# Comparing `tmp/iac_init-0.6.6.tar.gz` & `tmp/iac_init-0.6.7.tar.gz`

## filetype from file(1)

```diff
@@ -1 +1 @@
-gzip compressed data, was "iac_init-0.6.6.tar", max compression
+gzip compressed data, was "iac_init-0.6.7.tar", max compression
```

## Comparing `iac_init-0.6.6.tar` & `iac_init-0.6.7.tar`

### file list

```diff
@@ -1,103 +1,103 @@
--rw-r--r--   0        0        0    16295 2024-05-17 10:03:36.445953 iac_init-0.6.6/LICENSE
--rw-r--r--   0        0        0        0 2024-05-17 10:03:36.445953 iac_init-0.6.6/README.md
--rw-r--r--   0        0        0      389 2024-05-17 10:03:36.445953 iac_init-0.6.6/iac_init/__init__.py
--rw-r--r--   0        0        0      162 2024-05-17 10:03:36.445953 iac_init-0.6.6/iac_init/__main__.py
--rwxr-xr-x   0        0        0   723912 2024-05-17 10:03:52.249862 iac_init-0.6.6/iac_init/cli/main.so
--rwxr-xr-x   0        0        0    69808 2024-05-17 10:03:52.473860 iac_init-0.6.6/iac_init/cli/options.so
--rw-r--r--   0        0        0     2064 2024-05-17 10:03:36.445953 iac_init-0.6.6/iac_init/conf/__init__.py
--rwxr-xr-x   0        0        0   176224 2024-05-17 10:03:53.037857 iac_init-0.6.6/iac_init/conf/global_settings.so
--rwxr-xr-x   0        0        0   246152 2024-05-17 10:03:56.849831 iac_init-0.6.6/iac_init/scripts/ansible_tool.so
--rwxr-xr-x   0        0        0   293576 2024-05-17 10:03:58.297821 iac_init-0.6.6/iac_init/scripts/apic_connecton_tool.so

+    <89>   DW_AT_name        : (strp) (offset: 0x50ea): __uint32_t
     <8d>   DW_AT_decl_file   : (data1) 4
     <8e>   DW_AT_decl_line   : (data1) 42
     <8f>   DW_AT_decl_column : (data1) 22
     <90>   DW_AT_type        : (ref4) <0x44>, unsigned int
  <1><94>: Abbrev Number: 24 (DW_TAG_typedef)
     <95>   DW_AT_name        : (strp) (offset: 0x2cc0): __int64_t
     <99>   DW_AT_decl_file   : (data1) 4
     <9a>   DW_AT_decl_line   : (data1) 44
     <9b>   DW_AT_decl_column : (data1) 25
     <9c>   DW_AT_type        : (ref4) <0xa0>, long int
  <1><a0>: Abbrev Number: 57 (DW_TAG_base_type)
     <a1>   DW_AT_byte_size   : (data1) 8
     <a2>   DW_AT_encoding    : (data1) 5	(signed)
-    <a3>   DW_AT_name        : (strp) (offset: 0x5d5a): long int
+    <a3>   DW_AT_name        : (strp) (offset: 0x5d3a): long int
  <1><a7>: Abbrev Number: 35 (DW_TAG_const_type)
     <a8>   DW_AT_type        : (ref4) <0xa0>, long int
  <1><ac>: Abbrev Number: 24 (DW_TAG_typedef)
     <ad>   DW_AT_name        : (strp) (offset: 0x2d09): __uint64_t
     <b1>   DW_AT_decl_file   : (data1) 4
     <b2>   DW_AT_decl_line   : (data1) 45
     <b3>   DW_AT_decl_column : (data1) 27
@@ -118,35 +118,35 @@
  <1><ea>: Abbrev Number: 24 (DW_TAG_typedef)
     <eb>   DW_AT_name        : (strp) (offset: 0x2ff7): ssize_t
     <ef>   DW_AT_decl_file   : (data1) 5
     <f0>   DW_AT_decl_line   : (data1) 77
     <f1>   DW_AT_decl_column : (data1) 19
     <f2>   DW_AT_type        : (ref4) <0xb8>, __ssize_t, long int
  <1><f6>: Abbrev Number: 72 (DW_TAG_typedef)
-    <f7>   DW_AT_name        : (strp) (offset: 0x3b19): wchar_t
+    <f7>   DW_AT_name        : (strp) (offset: 0x3af9): wchar_t
     <fb>   DW_AT_decl_file   : (data1) 3
     <fc>   DW_AT_decl_line   : (data2) 321
     <fe>   DW_AT_decl_column : (data1) 24
     <ff>   DW_AT_type        : (ref4) <0x81>, int
  <1><103>: Abbrev Number: 57 (DW_TAG_base_type)
     <104>   DW_AT_byte_size   : (data1) 8
     <105>   DW_AT_encoding    : (data1) 5	(signed)
-    <106>   DW_AT_name        : (strp) (offset: 0x5d55): long long int
+    <106>   DW_AT_name        : (strp) (offset: 0x5d35): long long int
  <1><10a>: Abbrev Number: 35 (DW_TAG_const_type)
     <10b>   DW_AT_type        : (ref4) <0x103>, long long int
  <1><10f>: Abbrev Number: 24 (DW_TAG_typedef)
     <110>   DW_AT_name        : (strp) (offset: 0x2cc2): int64_t
     <114>   DW_AT_decl_file   : (data1) 6
     <115>   DW_AT_decl_line   : (data1) 27
     <116>   DW_AT_decl_column : (data1) 19
     <117>   DW_AT_type        : (ref4) <0x94>, __int64_t, long int
  <1><11b>: Abbrev Number: 57 (DW_TAG_base_type)
     <11c>   DW_AT_byte_size   : (data1) 8
     <11d>   DW_AT_encoding    : (data1) 7	(unsigned)
-    <11e>   DW_AT_name        : (strp) (offset: 0x55eb): long long unsigned int
+    <11e>   DW_AT_name        : (strp) (offset: 0x55cb): long long unsigned int
  <1><122>: Abbrev Number: 26 (DW_TAG_pointer_type)
     <123>   DW_AT_byte_size   : (implicit_const) 8
     <123>   DW_AT_type        : (ref4) <0x127>
  <1><127>: Abbrev Number: 102 (DW_TAG_const_type)
  <1><128>: Abbrev Number: 24 (DW_TAG_typedef)
     <129>   DW_AT_name        : (strp) (offset: 0x2b3): uint8_t
     <12d>   DW_AT_decl_file   : (data1) 7
@@ -156,27 +156,27 @@
  <1><134>: Abbrev Number: 24 (DW_TAG_typedef)
     <135>   DW_AT_name        : (strp) (offset: 0x16f3): uint16_t
     <139>   DW_AT_decl_file   : (data1) 7
     <13a>   DW_AT_decl_line   : (data1) 25
     <13b>   DW_AT_decl_column : (data1) 20
     <13c>   DW_AT_type        : (ref4) <0x75>, __uint16_t, short unsigned int
  <1><140>: Abbrev Number: 24 (DW_TAG_typedef)
-    <141>   DW_AT_name        : (strp) (offset: 0x510c): uint32_t
+    <141>   DW_AT_name        : (strp) (offset: 0x50ec): uint32_t
     <145>   DW_AT_decl_file   : (data1) 7
     <146>   DW_AT_decl_line   : (data1) 26
     <147>   DW_AT_decl_column : (data1) 20
     <148>   DW_AT_type        : (ref4) <0x88>, __uint32_t, unsigned int
  <1><14c>: Abbrev Number: 24 (DW_TAG_typedef)
     <14d>   DW_AT_name        : (strp) (offset: 0x2d0b): uint64_t
     <151>   DW_AT_decl_file   : (data1) 7
     <152>   DW_AT_decl_line   : (data1) 27
     <153>   DW_AT_decl_column : (data1) 20
     <154>   DW_AT_type        : (ref4) <0xac>, __uint64_t, long unsigned int
  <1><158>: Abbrev Number: 24 (DW_TAG_typedef)
-    <159>   DW_AT_name        : (strp) (offset: 0x5cb6): Py_ssize_t
+    <159>   DW_AT_name        : (strp) (offset: 0x5c96): Py_ssize_t
     <15d>   DW_AT_decl_file   : (data1) 8
     <15e>   DW_AT_decl_line   : (data1) 107
     <15f>   DW_AT_decl_column : (data1) 25
     <160>   DW_AT_type        : (ref4) <0xea>, ssize_t, __ssize_t, long int
  <1><164>: Abbrev Number: 35 (DW_TAG_const_type)
     <165>   DW_AT_type        : (ref4) <0x158>, Py_ssize_t, ssize_t, __ssize_t, long int
  <1><169>: Abbrev Number: 24 (DW_TAG_typedef)
@@ -184,15 +184,15 @@
     <16e>   DW_AT_decl_file   : (data1) 8
     <16f>   DW_AT_decl_line   : (data1) 116
     <170>   DW_AT_decl_column : (data1) 20
     <171>   DW_AT_type        : (ref4) <0x158>, Py_ssize_t, ssize_t, __ssize_t, long int
  <1><175>: Abbrev Number: 57 (DW_TAG_base_type)
     <176>   DW_AT_byte_size   : (data1) 4
     <177>   DW_AT_encoding    : (data1) 4	(float)
-    <178>   DW_AT_name        : (strp) (offset: 0x409d): float
+    <178>   DW_AT_name        : (strp) (offset: 0x407d): float
  <1><17c>: Abbrev Number: 24 (DW_TAG_typedef)
     <17d>   DW_AT_name        : (strp) (offset: 0x1751): PyTypeObject
     <181>   DW_AT_decl_file   : (data1) 2
     <182>   DW_AT_decl_line   : (data1) 66
     <183>   DW_AT_decl_column : (data1) 28
     <184>   DW_AT_type        : (ref4) <0x18d>, _typeobject
  <1><188>: Abbrev Number: 35 (DW_TAG_const_type)
@@ -215,15 +215,15 @@
     <1a8>   DW_AT_name        : (strp) (offset: 0x3643): tp_name
     <1ac>   DW_AT_decl_file   : (data1) 9
     <1ad>   DW_AT_decl_line   : (data1) 193
     <1ae>   DW_AT_decl_column : (data1) 17
     <1af>   DW_AT_type        : (ref4) <0xe5>
     <1b3>   DW_AT_data_member_location: (data1) 24
  <2><1b4>: Abbrev Number: 14 (DW_TAG_member)
-    <1b5>   DW_AT_name        : (strp) (offset: 0x6543): tp_basicsize
+    <1b5>   DW_AT_name        : (strp) (offset: 0x6547): tp_basicsize
     <1b9>   DW_AT_decl_file   : (data1) 9
     <1ba>   DW_AT_decl_line   : (data1) 194
     <1bb>   DW_AT_decl_column : (data1) 16
     <1bc>   DW_AT_type        : (ref4) <0x158>, Py_ssize_t, ssize_t, __ssize_t, long int
     <1c0>   DW_AT_data_member_location: (data1) 32
  <2><1c1>: Abbrev Number: 14 (DW_TAG_member)
     <1c2>   DW_AT_name        : (strp) (offset: 0x626): tp_itemsize
@@ -236,15 +236,15 @@
     <1cf>   DW_AT_name        : (strp) (offset: 0xaf7): tp_dealloc
     <1d3>   DW_AT_decl_file   : (data1) 9
     <1d4>   DW_AT_decl_line   : (data1) 198
     <1d5>   DW_AT_decl_column : (data1) 16
     <1d6>   DW_AT_type        : (ref4) <0x65b>, destructor
     <1da>   DW_AT_data_member_location: (data1) 48
  <2><1db>: Abbrev Number: 14 (DW_TAG_member)
-    <1dc>   DW_AT_name        : (strp) (offset: 0x41c3): tp_vectorcall_offset
+    <1dc>   DW_AT_name        : (strp) (offset: 0x41a3): tp_vectorcall_offset
     <1e0>   DW_AT_decl_file   : (data1) 9
     <1e1>   DW_AT_decl_line   : (data1) 199
     <1e2>   DW_AT_decl_column : (data1) 16
     <1e3>   DW_AT_type        : (ref4) <0x158>, Py_ssize_t, ssize_t, __ssize_t, long int
     <1e7>   DW_AT_data_member_location: (data1) 56
  <2><1e8>: Abbrev Number: 14 (DW_TAG_member)
     <1e9>   DW_AT_name        : (strp) (offset: 0x232): tp_getattr
@@ -264,43 +264,43 @@
     <203>   DW_AT_name        : (strp) (offset: 0x3a0): tp_as_async
     <207>   DW_AT_decl_file   : (data1) 9
     <208>   DW_AT_decl_line   : (data1) 202
     <209>   DW_AT_decl_column : (data1) 21
     <20a>   DW_AT_type        : (ref4) <0xcb2>
     <20e>   DW_AT_data_member_location: (data1) 80
  <2><20f>: Abbrev Number: 14 (DW_TAG_member)
-    <210>   DW_AT_name        : (strp) (offset: 0x5c28): tp_repr
+    <210>   DW_AT_name        : (strp) (offset: 0x5c08): tp_repr
     <214>   DW_AT_decl_file   : (data1) 9
     <215>   DW_AT_decl_line   : (data1) 204
     <216>   DW_AT_decl_column : (data1) 14
     <217>   DW_AT_type        : (ref4) <0x6de>, reprfunc
     <21b>   DW_AT_data_member_location: (data1) 88
  <2><21c>: Abbrev Number: 14 (DW_TAG_member)
-    <21d>   DW_AT_name        : (strp) (offset: 0x4353): tp_as_number
+    <21d>   DW_AT_name        : (strp) (offset: 0x4333): tp_as_number
     <221>   DW_AT_decl_file   : (data1) 9
     <222>   DW_AT_decl_line   : (data1) 208
     <223>   DW_AT_decl_column : (data1) 22
     <224>   DW_AT_type        : (ref4) <0xcb7>
     <228>   DW_AT_data_member_location: (data1) 96
  <2><229>: Abbrev Number: 14 (DW_TAG_member)
     <22a>   DW_AT_name        : (strp) (offset: 0x36f7): tp_as_sequence
     <22e>   DW_AT_decl_file   : (data1) 9
     <22f>   DW_AT_decl_line   : (data1) 209
     <230>   DW_AT_decl_column : (data1) 24
     <231>   DW_AT_type        : (ref4) <0xcbc>
     <235>   DW_AT_data_member_location: (data1) 104
  <2><236>: Abbrev Number: 14 (DW_TAG_member)
-    <237>   DW_AT_name        : (strp) (offset: 0x209b): tp_as_mapping
+    <237>   DW_AT_name        : (strp) (offset: 0x20bd): tp_as_mapping
     <23b>   DW_AT_decl_file   : (data1) 9
     <23c>   DW_AT_decl_line   : (data1) 210
     <23d>   DW_AT_decl_column : (data1) 23
     <23e>   DW_AT_type        : (ref4) <0xcc1>
     <242>   DW_AT_data_member_location: (data1) 112
  <2><243>: Abbrev Number: 14 (DW_TAG_member)
-    <244>   DW_AT_name        : (strp) (offset: 0x4ab1): tp_hash
+    <244>   DW_AT_name        : (strp) (offset: 0x4a91): tp_hash
     <248>   DW_AT_decl_file   : (data1) 9
     <249>   DW_AT_decl_line   : (data1) 214
     <24a>   DW_AT_decl_column : (data1) 14
     <24b>   DW_AT_type        : (ref4) <0x6ea>, hashfunc
     <24f>   DW_AT_data_member_location: (data1) 120
  <2><250>: Abbrev Number: 14 (DW_TAG_member)
     <251>   DW_AT_name        : (strp) (offset: 0x1534): tp_call
@@ -313,50 +313,50 @@
     <25e>   DW_AT_name        : (strp) (offset: 0x1634): tp_str
     <262>   DW_AT_decl_file   : (data1) 9
     <263>   DW_AT_decl_line   : (data1) 216
     <264>   DW_AT_decl_column : (data1) 14
     <265>   DW_AT_type        : (ref4) <0x6de>, reprfunc
     <269>   DW_AT_data_member_location: (data1) 136
  <2><26a>: Abbrev Number: 14 (DW_TAG_member)
-    <26b>   DW_AT_name        : (strp) (offset: 0x3c51): tp_getattro
+    <26b>   DW_AT_name        : (strp) (offset: 0x3c31): tp_getattro
     <26f>   DW_AT_decl_file   : (data1) 9
     <270>   DW_AT_decl_line   : (data1) 217
     <271>   DW_AT_decl_column : (data1) 18
     <272>   DW_AT_type        : (ref4) <0x69c>, getattrofunc
     <276>   DW_AT_data_member_location: (data1) 144
  <2><277>: Abbrev Number: 14 (DW_TAG_member)
-    <278>   DW_AT_name        : (strp) (offset: 0x50c6): tp_setattro
+    <278>   DW_AT_name        : (strp) (offset: 0x50a6): tp_setattro
     <27c>   DW_AT_decl_file   : (data1) 9
     <27d>   DW_AT_decl_line   : (data1) 218
     <27e>   DW_AT_decl_column : (data1) 18
     <27f>   DW_AT_type        : (ref4) <0x6d2>, setattrofunc
     <283>   DW_AT_data_member_location: (data1) 152
  <2><284>: Abbrev Number: 14 (DW_TAG_member)
     <285>   DW_AT_name        : (strp) (offset: 0x3740): tp_as_buffer
     <289>   DW_AT_decl_file   : (data1) 9
     <28a>   DW_AT_decl_line   : (data1) 221
     <28b>   DW_AT_decl_column : (data1) 20
     <28c>   DW_AT_type        : (ref4) <0xcc6>
     <290>   DW_AT_data_member_location: (data1) 160
  <2><291>: Abbrev Number: 14 (DW_TAG_member)
-    <292>   DW_AT_name        : (strp) (offset: 0x5f42): tp_flags
+    <292>   DW_AT_name        : (strp) (offset: 0x5f46): tp_flags
     <296>   DW_AT_decl_file   : (data1) 9
     <297>   DW_AT_decl_line   : (data1) 224
     <298>   DW_AT_decl_column : (data1) 19
     <299>   DW_AT_type        : (ref4) <0x3d>, long unsigned int
     <29d>   DW_AT_data_member_location: (data1) 168
  <2><29e>: Abbrev Number: 14 (DW_TAG_member)
-    <29f>   DW_AT_name        : (strp) (offset: 0x4579): tp_doc
+    <29f>   DW_AT_name        : (strp) (offset: 0x4559): tp_doc
     <2a3>   DW_AT_decl_file   : (data1) 9
     <2a4>   DW_AT_decl_line   : (data1) 226
     <2a5>   DW_AT_decl_column : (data1) 17
     <2a6>   DW_AT_type        : (ref4) <0xe5>
     <2aa>   DW_AT_data_member_location: (data1) 176
  <2><2ab>: Abbrev Number: 14 (DW_TAG_member)
-    <2ac>   DW_AT_name        : (strp) (offset: 0x4eb9): tp_traverse
+    <2ac>   DW_AT_name        : (strp) (offset: 0x4e99): tp_traverse
     <2b0>   DW_AT_decl_file   : (data1) 9
     <2b1>   DW_AT_decl_line   : (data1) 230
     <2b2>   DW_AT_decl_column : (data1) 18
     <2b3>   DW_AT_type        : (ref4) <0x615>, traverseproc
     <2b7>   DW_AT_data_member_location: (data1) 184
  <2><2b8>: Abbrev Number: 14 (DW_TAG_member)
     <2b9>   DW_AT_name        : (strp) (offset: 0x1cbb): tp_clear
@@ -369,99 +369,99 @@
     <2c6>   DW_AT_name        : (strp) (offset: 0xee0): tp_richcompare
     <2ca>   DW_AT_decl_file   : (data1) 9
     <2cb>   DW_AT_decl_line   : (data1) 237
     <2cc>   DW_AT_decl_column : (data1) 17
     <2cd>   DW_AT_type        : (ref4) <0x70a>, richcmpfunc
     <2d1>   DW_AT_data_member_location: (data1) 200
  <2><2d2>: Abbrev Number: 14 (DW_TAG_member)
-    <2d3>   DW_AT_name        : (strp) (offset: 0x445e): tp_weaklistoffset
+    <2d3>   DW_AT_name        : (strp) (offset: 0x443e): tp_weaklistoffset
     <2d7>   DW_AT_decl_file   : (data1) 9
     <2d8>   DW_AT_decl_line   : (data1) 240
     <2d9>   DW_AT_decl_column : (data1) 16
     <2da>   DW_AT_type        : (ref4) <0x158>, Py_ssize_t, ssize_t, __ssize_t, long int
     <2de>   DW_AT_data_member_location: (data1) 208
  <2><2df>: Abbrev Number: 14 (DW_TAG_member)
-    <2e0>   DW_AT_name        : (strp) (offset: 0x531d): tp_iter
+    <2e0>   DW_AT_name        : (strp) (offset: 0x52fd): tp_iter
     <2e4>   DW_AT_decl_file   : (data1) 9
     <2e5>   DW_AT_decl_line   : (data1) 243
     <2e6>   DW_AT_decl_column : (data1) 17
     <2e7>   DW_AT_type        : (ref4) <0x734>, getiterfunc
     <2eb>   DW_AT_data_member_location: (data1) 216
  <2><2ec>: Abbrev Number: 14 (DW_TAG_member)
-    <2ed>   DW_AT_name        : (strp) (offset: 0x5243): tp_iternext
+    <2ed>   DW_AT_name        : (strp) (offset: 0x5223): tp_iternext
     <2f1>   DW_AT_decl_file   : (data1) 9
     <2f2>   DW_AT_decl_line   : (data1) 244
     <2f3>   DW_AT_decl_column : (data1) 18
     <2f4>   DW_AT_type        : (ref4) <0x740>, iternextfunc
     <2f8>   DW_AT_data_member_location: (data1) 224
  <2><2f9>: Abbrev Number: 14 (DW_TAG_member)
-    <2fa>   DW_AT_name        : (strp) (offset: 0x3d79): tp_methods
+    <2fa>   DW_AT_name        : (strp) (offset: 0x3d59): tp_methods
     <2fe>   DW_AT_decl_file   : (data1) 9
     <2ff>   DW_AT_decl_line   : (data1) 247
     <300>   DW_AT_decl_column : (data1) 25
     <301>   DW_AT_type        : (ref4) <0xd0d>
     <305>   DW_AT_data_member_location: (data1) 232
  <2><306>: Abbrev Number: 14 (DW_TAG_member)
-    <307>   DW_AT_name        : (strp) (offset: 0x4e9f): tp_members
+    <307>   DW_AT_name        : (strp) (offset: 0x4e7f): tp_members
     <30b>   DW_AT_decl_file   : (data1) 9
     <30c>   DW_AT_decl_line   : (data1) 248
     <30d>   DW_AT_decl_column : (data1) 25
     <30e>   DW_AT_type        : (ref4) <0xd61>
     <312>   DW_AT_data_member_location: (data1) 240
  <2><313>: Abbrev Number: 14 (DW_TAG_member)
-    <314>   DW_AT_name        : (strp) (offset: 0x51a0): tp_getset
+    <314>   DW_AT_name        : (strp) (offset: 0x5180): tp_getset
     <318>   DW_AT_decl_file   : (data1) 9
     <319>   DW_AT_decl_line   : (data1) 249
     <31a>   DW_AT_decl_column : (data1) 25
     <31b>   DW_AT_type        : (ref4) <0xdb5>
     <31f>   DW_AT_data_member_location: (data1) 248
  <2><320>: Abbrev Number: 59 (DW_TAG_member)
-    <321>   DW_AT_name        : (strp) (offset: 0x5467): tp_base
+    <321>   DW_AT_name        : (strp) (offset: 0x5447): tp_base
     <325>   DW_AT_decl_file   : (data1) 9
     <326>   DW_AT_decl_line   : (data1) 251
     <327>   DW_AT_decl_column : (data1) 25
     <328>   DW_AT_type        : (ref4) <0xdba>
     <32c>   DW_AT_data_member_location: (data2) 256
  <2><32e>: Abbrev Number: 59 (DW_TAG_member)
-    <32f>   DW_AT_name        : (strp) (offset: 0x204f): tp_dict
+    <32f>   DW_AT_name        : (strp) (offset: 0x2071): tp_dict
     <333>   DW_AT_decl_file   : (data1) 9
     <334>   DW_AT_decl_line   : (data1) 252
     <335>   DW_AT_decl_column : (data1) 15
     <336>   DW_AT_type        : (ref4) <0x4b9>
     <33a>   DW_AT_data_member_location: (data2) 264
  <2><33c>: Abbrev Number: 59 (DW_TAG_member)
-    <33d>   DW_AT_name        : (strp) (offset: 0x5310): tp_descr_get
+    <33d>   DW_AT_name        : (strp) (offset: 0x52f0): tp_descr_get
     <341>   DW_AT_decl_file   : (data1) 9
     <342>   DW_AT_decl_line   : (data1) 253
     <343>   DW_AT_decl_column : (data1) 18
     <344>   DW_AT_type        : (ref4) <0x74c>, descrgetfunc
     <348>   DW_AT_data_member_location: (data2) 272
  <2><34a>: Abbrev Number: 59 (DW_TAG_member)
-    <34b>   DW_AT_name        : (strp) (offset: 0x63fd): tp_descr_set
+    <34b>   DW_AT_name        : (strp) (offset: 0x6401): tp_descr_set
     <34f>   DW_AT_decl_file   : (data1) 9
     <350>   DW_AT_decl_line   : (data1) 254
     <351>   DW_AT_decl_column : (data1) 18
     <352>   DW_AT_type        : (ref4) <0x758>, descrsetfunc
     <356>   DW_AT_data_member_location: (data2) 280
  <2><358>: Abbrev Number: 59 (DW_TAG_member)
     <359>   DW_AT_name        : (strp) (offset: 0x1b38): tp_dictoffset
     <35d>   DW_AT_decl_file   : (data1) 9
     <35e>   DW_AT_decl_line   : (data1) 255
     <35f>   DW_AT_decl_column : (data1) 16
     <360>   DW_AT_type        : (ref4) <0x158>, Py_ssize_t, ssize_t, __ssize_t, long int
     <364>   DW_AT_data_member_location: (data2) 288
  <2><366>: Abbrev Number: 56 (DW_TAG_member)
-    <367>   DW_AT_name        : (strp) (offset: 0x1f73): tp_init
+    <367>   DW_AT_name        : (strp) (offset: 0x1f95): tp_init
     <36b>   DW_AT_decl_file   : (implicit_const) 9
     <36b>   DW_AT_decl_line   : (data2) 256
     <36d>   DW_AT_decl_column : (data1) 14
     <36e>   DW_AT_type        : (ref4) <0x764>, initproc
     <372>   DW_AT_data_member_location: (data2) 296
  <2><374>: Abbrev Number: 56 (DW_TAG_member)
-    <375>   DW_AT_name        : (strp) (offset: 0x39aa): tp_alloc
+    <375>   DW_AT_name        : (strp) (offset: 0x398a): tp_alloc
     <379>   DW_AT_decl_file   : (implicit_const) 9
     <379>   DW_AT_decl_line   : (data2) 257
     <37b>   DW_AT_decl_column : (data1) 15
     <37c>   DW_AT_type        : (ref4) <0x79a>, allocfunc
     <380>   DW_AT_data_member_location: (data2) 304
  <2><382>: Abbrev Number: 56 (DW_TAG_member)
     <383>   DW_AT_name        : (strp) (offset: 0x32e2): tp_new
@@ -488,64 +488,64 @@
     <3ad>   DW_AT_name        : (strp) (offset: 0x86c): tp_bases
     <3b1>   DW_AT_decl_file   : (implicit_const) 9
     <3b1>   DW_AT_decl_line   : (data2) 261
     <3b3>   DW_AT_decl_column : (data1) 15
     <3b4>   DW_AT_type        : (ref4) <0x4b9>
     <3b8>   DW_AT_data_member_location: (data2) 336
  <2><3ba>: Abbrev Number: 56 (DW_TAG_member)
-    <3bb>   DW_AT_name        : (strp) (offset: 0x3dd0): tp_mro
+    <3bb>   DW_AT_name        : (strp) (offset: 0x3db0): tp_mro
     <3bf>   DW_AT_decl_file   : (implicit_const) 9
     <3bf>   DW_AT_decl_line   : (data2) 262
     <3c1>   DW_AT_decl_column : (data1) 15
     <3c2>   DW_AT_type        : (ref4) <0x4b9>
     <3c6>   DW_AT_data_member_location: (data2) 344
  <2><3c8>: Abbrev Number: 56 (DW_TAG_member)
-    <3c9>   DW_AT_name        : (strp) (offset: 0x5c61): tp_cache
+    <3c9>   DW_AT_name        : (strp) (offset: 0x5c41): tp_cache
     <3cd>   DW_AT_decl_file   : (implicit_const) 9
     <3cd>   DW_AT_decl_line   : (data2) 263
     <3cf>   DW_AT_decl_column : (data1) 15
     <3d0>   DW_AT_type        : (ref4) <0x4b9>
     <3d4>   DW_AT_data_member_location: (data2) 352
  <2><3d6>: Abbrev Number: 56 (DW_TAG_member)
-    <3d7>   DW_AT_name        : (strp) (offset: 0x4fbc): tp_subclasses
+    <3d7>   DW_AT_name        : (strp) (offset: 0x4f9c): tp_subclasses
     <3db>   DW_AT_decl_file   : (implicit_const) 9
     <3db>   DW_AT_decl_line   : (data2) 264
     <3dd>   DW_AT_decl_column : (data1) 15
     <3de>   DW_AT_type        : (ref4) <0x4b9>
     <3e2>   DW_AT_data_member_location: (data2) 360
  <2><3e4>: Abbrev Number: 56 (DW_TAG_member)
-    <3e5>   DW_AT_name        : (strp) (offset: 0x47ad): tp_weaklist
+    <3e5>   DW_AT_name        : (strp) (offset: 0x478d): tp_weaklist
     <3e9>   DW_AT_decl_file   : (implicit_const) 9
     <3e9>   DW_AT_decl_line   : (data2) 265
     <3eb>   DW_AT_decl_column : (data1) 15
     <3ec>   DW_AT_type        : (ref4) <0x4b9>
     <3f0>   DW_AT_data_member_location: (data2) 368
  <2><3f2>: Abbrev Number: 56 (DW_TAG_member)
     <3f3>   DW_AT_name        : (strp) (offset: 0x35ad): tp_del
     <3f7>   DW_AT_decl_file   : (implicit_const) 9
     <3f7>   DW_AT_decl_line   : (data2) 266
     <3f9>   DW_AT_decl_column : (data1) 16
     <3fa>   DW_AT_type        : (ref4) <0x65b>, destructor
     <3fe>   DW_AT_data_member_location: (data2) 376
  <2><400>: Abbrev Number: 56 (DW_TAG_member)
-    <401>   DW_AT_name        : (strp) (offset: 0x4bd2): tp_version_tag
+    <401>   DW_AT_name        : (strp) (offset: 0x4bb2): tp_version_tag
     <405>   DW_AT_decl_file   : (implicit_const) 9
     <405>   DW_AT_decl_line   : (data2) 269
     <407>   DW_AT_decl_column : (data1) 18
     <408>   DW_AT_type        : (ref4) <0x44>, unsigned int
     <40c>   DW_AT_data_member_location: (data2) 384
  <2><40e>: Abbrev Number: 56 (DW_TAG_member)
     <40f>   DW_AT_name        : (strp) (offset: 0x1bd4): tp_finalize
     <413>   DW_AT_decl_file   : (implicit_const) 9
     <413>   DW_AT_decl_line   : (data2) 271
     <415>   DW_AT_decl_column : (data1) 16
     <416>   DW_AT_type        : (ref4) <0x65b>, destructor
     <41a>   DW_AT_data_member_location: (data2) 392
  <2><41c>: Abbrev Number: 56 (DW_TAG_member)
-    <41d>   DW_AT_name        : (strp) (offset: 0x4b75): tp_vectorcall
+    <41d>   DW_AT_name        : (strp) (offset: 0x4b55): tp_vectorcall
     <421>   DW_AT_decl_file   : (implicit_const) 9
     <421>   DW_AT_decl_line   : (data2) 272
     <423>   DW_AT_decl_column : (data1) 20
     <424>   DW_AT_type        : (ref4) <0x911>, vectorcallfunc
     <428>   DW_AT_data_member_location: (data2) 400
  <2><42a>: Abbrev Number: 0
  <1><42b>: Abbrev Number: 58 (DW_TAG_structure_type)
@@ -591,29 +591,29 @@
     <473>   DW_AT_name        : (strp) (offset: 0x1749): ob_base
     <477>   DW_AT_decl_file   : (data1) 2
     <478>   DW_AT_decl_line   : (data1) 116
     <479>   DW_AT_decl_column : (data1) 14
     <47a>   DW_AT_type        : (ref4) <0x458>, PyObject, _object
     <47e>   DW_AT_data_member_location: (data1) 0
  <2><47f>: Abbrev Number: 14 (DW_TAG_member)
-    <480>   DW_AT_name        : (strp) (offset: 0x1fbe): ob_size
+    <480>   DW_AT_name        : (strp) (offset: 0x1fe0): ob_size
     <484>   DW_AT_decl_file   : (data1) 2
     <485>   DW_AT_decl_line   : (data1) 117
     <486>   DW_AT_decl_column : (data1) 16
     <487>   DW_AT_type        : (ref4) <0x158>, Py_ssize_t, ssize_t, __ssize_t, long int
     <48b>   DW_AT_data_member_location: (data1) 16
  <2><48c>: Abbrev Number: 0
  <1><48d>: Abbrev Number: 24 (DW_TAG_typedef)
     <48e>   DW_AT_name        : (strp) (offset: 0x13a5): PyVarObject
     <492>   DW_AT_decl_file   : (data1) 2
     <493>   DW_AT_decl_line   : (data1) 118
     <494>   DW_AT_decl_column : (data1) 3
     <495>   DW_AT_type        : (ref4) <0x469>
  <1><499>: Abbrev Number: 24 (DW_TAG_typedef)
-    <49a>   DW_AT_name        : (strp) (offset: 0x4035): unaryfunc
+    <49a>   DW_AT_name        : (strp) (offset: 0x4015): unaryfunc
     <49e>   DW_AT_decl_file   : (data1) 2
     <49f>   DW_AT_decl_line   : (data1) 184
     <4a0>   DW_AT_decl_column : (data1) 22
     <4a1>   DW_AT_type        : (ref4) <0x4a5>
  <1><4a5>: Abbrev Number: 26 (DW_TAG_pointer_type)
     <4a6>   DW_AT_byte_size   : (implicit_const) 8
     <4a6>   DW_AT_type        : (ref4) <0x4aa>
@@ -626,15 +626,15 @@
  <2><4b8>: Abbrev Number: 0
  <1><4b9>: Abbrev Number: 26 (DW_TAG_pointer_type)
     <4ba>   DW_AT_byte_size   : (implicit_const) 8
     <4ba>   DW_AT_type        : (ref4) <0x458>, PyObject, _object
  <1><4be>: Abbrev Number: 35 (DW_TAG_const_type)
     <4bf>   DW_AT_type        : (ref4) <0x4b9>
  <1><4c3>: Abbrev Number: 24 (DW_TAG_typedef)
-    <4c4>   DW_AT_name        : (strp) (offset: 0x214e): binaryfunc
+    <4c4>   DW_AT_name        : (strp) (offset: 0x2170): binaryfunc
     <4c8>   DW_AT_decl_file   : (data1) 2
     <4c9>   DW_AT_decl_line   : (data1) 185
     <4ca>   DW_AT_decl_column : (data1) 22
     <4cb>   DW_AT_type        : (ref4) <0x4cf>
  <1><4cf>: Abbrev Number: 26 (DW_TAG_pointer_type)
     <4d0>   DW_AT_byte_size   : (implicit_const) 8
     <4d0>   DW_AT_type        : (ref4) <0x4d4>
@@ -664,15 +664,15 @@
     <503>   DW_AT_type        : (ref4) <0x4b9>
  <2><507>: Abbrev Number: 15 (DW_TAG_formal_parameter)
     <508>   DW_AT_type        : (ref4) <0x4b9>
  <2><50c>: Abbrev Number: 15 (DW_TAG_formal_parameter)
     <50d>   DW_AT_type        : (ref4) <0x4b9>
  <2><511>: Abbrev Number: 0
  <1><512>: Abbrev Number: 24 (DW_TAG_typedef)
-    <513>   DW_AT_name        : (strp) (offset: 0x4206): inquiry
+    <513>   DW_AT_name        : (strp) (offset: 0x41e6): inquiry
     <517>   DW_AT_decl_file   : (data1) 2
     <518>   DW_AT_decl_line   : (data1) 187
     <519>   DW_AT_decl_column : (data1) 15
     <51a>   DW_AT_type        : (ref4) <0x51e>
  <1><51e>: Abbrev Number: 26 (DW_TAG_pointer_type)
     <51f>   DW_AT_byte_size   : (implicit_const) 8
     <51f>   DW_AT_type        : (ref4) <0x523>, int
@@ -696,15 +696,15 @@
     <544>   DW_AT_prototyped  : (flag_present) 1
     <544>   DW_AT_type        : (ref4) <0x158>, Py_ssize_t, ssize_t, __ssize_t, long int
     <548>   DW_AT_sibling     : (ref4) <0x552>
  <2><54c>: Abbrev Number: 15 (DW_TAG_formal_parameter)
     <54d>   DW_AT_type        : (ref4) <0x4b9>
  <2><551>: Abbrev Number: 0
  <1><552>: Abbrev Number: 24 (DW_TAG_typedef)
-    <553>   DW_AT_name        : (strp) (offset: 0x2466): ssizeargfunc
+    <553>   DW_AT_name        : (strp) (offset: 0x2488): ssizeargfunc
     <557>   DW_AT_decl_file   : (data1) 2
     <558>   DW_AT_decl_line   : (data1) 189
     <559>   DW_AT_decl_column : (data1) 21
     <55a>   DW_AT_type        : (ref4) <0x55e>
  <1><55e>: Abbrev Number: 26 (DW_TAG_pointer_type)
     <55f>   DW_AT_byte_size   : (implicit_const) 8
     <55f>   DW_AT_type        : (ref4) <0x563>
@@ -714,15 +714,15 @@
     <568>   DW_AT_sibling     : (ref4) <0x577>
  <2><56c>: Abbrev Number: 15 (DW_TAG_formal_parameter)
     <56d>   DW_AT_type        : (ref4) <0x4b9>
  <2><571>: Abbrev Number: 15 (DW_TAG_formal_parameter)
     <572>   DW_AT_type        : (ref4) <0x158>, Py_ssize_t, ssize_t, __ssize_t, long int
  <2><576>: Abbrev Number: 0
  <1><577>: Abbrev Number: 24 (DW_TAG_typedef)
-    <578>   DW_AT_name        : (strp) (offset: 0x4b10): ssizeobjargproc
+    <578>   DW_AT_name        : (strp) (offset: 0x4af0): ssizeobjargproc
     <57c>   DW_AT_decl_file   : (data1) 2
     <57d>   DW_AT_decl_line   : (data1) 191
     <57e>   DW_AT_decl_column : (data1) 14
     <57f>   DW_AT_type        : (ref4) <0x583>
  <1><583>: Abbrev Number: 26 (DW_TAG_pointer_type)
     <584>   DW_AT_byte_size   : (implicit_const) 8
     <584>   DW_AT_type        : (ref4) <0x588>, int
@@ -734,15 +734,15 @@
     <592>   DW_AT_type        : (ref4) <0x4b9>
  <2><596>: Abbrev Number: 15 (DW_TAG_formal_parameter)
     <597>   DW_AT_type        : (ref4) <0x158>, Py_ssize_t, ssize_t, __ssize_t, long int
  <2><59b>: Abbrev Number: 15 (DW_TAG_formal_parameter)
     <59c>   DW_AT_type        : (ref4) <0x4b9>
  <2><5a0>: Abbrev Number: 0
  <1><5a1>: Abbrev Number: 24 (DW_TAG_typedef)
-    <5a2>   DW_AT_name        : (strp) (offset: 0x1fb0): objobjargproc
+    <5a2>   DW_AT_name        : (strp) (offset: 0x1fd2): objobjargproc
     <5a6>   DW_AT_decl_file   : (data1) 2
     <5a7>   DW_AT_decl_line   : (data1) 193
     <5a8>   DW_AT_decl_column : (data1) 14
     <5a9>   DW_AT_type        : (ref4) <0x5ad>
  <1><5ad>: Abbrev Number: 26 (DW_TAG_pointer_type)
     <5ae>   DW_AT_byte_size   : (implicit_const) 8
     <5ae>   DW_AT_type        : (ref4) <0x5b2>, int
@@ -754,15 +754,15 @@
     <5bc>   DW_AT_type        : (ref4) <0x4b9>
  <2><5c0>: Abbrev Number: 15 (DW_TAG_formal_parameter)
     <5c1>   DW_AT_type        : (ref4) <0x4b9>
  <2><5c5>: Abbrev Number: 15 (DW_TAG_formal_parameter)
     <5c6>   DW_AT_type        : (ref4) <0x4b9>
  <2><5ca>: Abbrev Number: 0
  <1><5cb>: Abbrev Number: 24 (DW_TAG_typedef)
-    <5cc>   DW_AT_name        : (strp) (offset: 0x6636): objobjproc
+    <5cc>   DW_AT_name        : (strp) (offset: 0x663a): objobjproc
     <5d0>   DW_AT_decl_file   : (data1) 2
     <5d1>   DW_AT_decl_line   : (data1) 195
     <5d2>   DW_AT_decl_column : (data1) 15
     <5d3>   DW_AT_type        : (ref4) <0x5d7>
  <1><5d7>: Abbrev Number: 26 (DW_TAG_pointer_type)
     <5d8>   DW_AT_byte_size   : (implicit_const) 8
     <5d8>   DW_AT_type        : (ref4) <0x5dc>, int
@@ -790,15 +790,15 @@
     <606>   DW_AT_sibling     : (ref4) <0x615>
  <2><60a>: Abbrev Number: 15 (DW_TAG_formal_parameter)
     <60b>   DW_AT_type        : (ref4) <0x4b9>
  <2><60f>: Abbrev Number: 15 (DW_TAG_formal_parameter)
     <610>   DW_AT_type        : (ref4) <0x4b>
  <2><614>: Abbrev Number: 0
  <1><615>: Abbrev Number: 24 (DW_TAG_typedef)
-    <616>   DW_AT_name        : (strp) (offset: 0x4173): traverseproc
+    <616>   DW_AT_name        : (strp) (offset: 0x4153): traverseproc
     <61a>   DW_AT_decl_file   : (data1) 2
     <61b>   DW_AT_decl_line   : (data1) 197
     <61c>   DW_AT_decl_column : (data1) 15
     <61d>   DW_AT_type        : (ref4) <0x621>
  <1><621>: Abbrev Number: 26 (DW_TAG_pointer_type)
     <622>   DW_AT_byte_size   : (implicit_const) 8
     <622>   DW_AT_type        : (ref4) <0x626>, int
@@ -810,15 +810,15 @@
     <630>   DW_AT_type        : (ref4) <0x4b9>
  <2><634>: Abbrev Number: 15 (DW_TAG_formal_parameter)
     <635>   DW_AT_type        : (ref4) <0x5f0>, visitproc
  <2><639>: Abbrev Number: 15 (DW_TAG_formal_parameter)
     <63a>   DW_AT_type        : (ref4) <0x4b>
  <2><63e>: Abbrev Number: 0
  <1><63f>: Abbrev Number: 24 (DW_TAG_typedef)
-    <640>   DW_AT_name        : (strp) (offset: 0x50d2): freefunc
+    <640>   DW_AT_name        : (strp) (offset: 0x50b2): freefunc
     <644>   DW_AT_decl_file   : (data1) 2
     <645>   DW_AT_decl_line   : (data1) 200
     <646>   DW_AT_decl_column : (data1) 16
     <647>   DW_AT_type        : (ref4) <0x64b>
  <1><64b>: Abbrev Number: 26 (DW_TAG_pointer_type)
     <64c>   DW_AT_byte_size   : (implicit_const) 8
     <64c>   DW_AT_type        : (ref4) <0x650>
@@ -840,15 +840,15 @@
  <1><66c>: Abbrev Number: 79 (DW_TAG_subroutine_type)
     <66d>   DW_AT_prototyped  : (flag_present) 1
     <66d>   DW_AT_sibling     : (ref4) <0x677>
  <2><671>: Abbrev Number: 15 (DW_TAG_formal_parameter)
     <672>   DW_AT_type        : (ref4) <0x4b9>
  <2><676>: Abbrev Number: 0
  <1><677>: Abbrev Number: 24 (DW_TAG_typedef)
-    <678>   DW_AT_name        : (strp) (offset: 0x488f): getattrfunc
+    <678>   DW_AT_name        : (strp) (offset: 0x486f): getattrfunc
     <67c>   DW_AT_decl_file   : (data1) 2
     <67d>   DW_AT_decl_line   : (data1) 202
     <67e>   DW_AT_decl_column : (data1) 21
     <67f>   DW_AT_type        : (ref4) <0x683>
  <1><683>: Abbrev Number: 26 (DW_TAG_pointer_type)
     <684>   DW_AT_byte_size   : (implicit_const) 8
     <684>   DW_AT_type        : (ref4) <0x688>
@@ -858,21 +858,21 @@
     <68d>   DW_AT_sibling     : (ref4) <0x69c>
  <2><691>: Abbrev Number: 15 (DW_TAG_formal_parameter)
     <692>   DW_AT_type        : (ref4) <0x4b9>
  <2><696>: Abbrev Number: 15 (DW_TAG_formal_parameter)
     <697>   DW_AT_type        : (ref4) <0xc4>
  <2><69b>: Abbrev Number: 0
  <1><69c>: Abbrev Number: 24 (DW_TAG_typedef)
-    <69d>   DW_AT_name        : (strp) (offset: 0x45b2): getattrofunc
+    <69d>   DW_AT_name        : (strp) (offset: 0x4592): getattrofunc
     <6a1>   DW_AT_decl_file   : (data1) 2
     <6a2>   DW_AT_decl_line   : (data1) 203
     <6a3>   DW_AT_decl_column : (data1) 21
     <6a4>   DW_AT_type        : (ref4) <0x4cf>
  <1><6a8>: Abbrev Number: 24 (DW_TAG_typedef)
-    <6a9>   DW_AT_name        : (strp) (offset: 0x20b0): setattrfunc
+    <6a9>   DW_AT_name        : (strp) (offset: 0x20d2): setattrfunc
     <6ad>   DW_AT_decl_file   : (data1) 2
     <6ae>   DW_AT_decl_line   : (data1) 204
     <6af>   DW_AT_decl_column : (data1) 15
     <6b0>   DW_AT_type        : (ref4) <0x6b4>
  <1><6b4>: Abbrev Number: 26 (DW_TAG_pointer_type)
     <6b5>   DW_AT_byte_size   : (implicit_const) 8
     <6b5>   DW_AT_type        : (ref4) <0x6b9>, int
@@ -896,15 +896,15 @@
  <1><6de>: Abbrev Number: 24 (DW_TAG_typedef)
     <6df>   DW_AT_name        : (strp) (offset: 0x2839): reprfunc
     <6e3>   DW_AT_decl_file   : (data1) 2
     <6e4>   DW_AT_decl_line   : (data1) 206
     <6e5>   DW_AT_decl_column : (data1) 21
     <6e6>   DW_AT_type        : (ref4) <0x4a5>
  <1><6ea>: Abbrev Number: 24 (DW_TAG_typedef)
-    <6eb>   DW_AT_name        : (strp) (offset: 0x4886): hashfunc
+    <6eb>   DW_AT_name        : (strp) (offset: 0x4866): hashfunc
     <6ef>   DW_AT_decl_file   : (data1) 2
     <6f0>   DW_AT_decl_line   : (data1) 207
     <6f1>   DW_AT_decl_column : (data1) 21
     <6f2>   DW_AT_type        : (ref4) <0x6f6>
  <1><6f6>: Abbrev Number: 26 (DW_TAG_pointer_type)
     <6f7>   DW_AT_byte_size   : (implicit_const) 8
     <6f7>   DW_AT_type        : (ref4) <0x6fb>, Py_hash_t, Py_ssize_t, ssize_t, __ssize_t, long int
@@ -932,21 +932,21 @@
     <725>   DW_AT_type        : (ref4) <0x4b9>
  <2><729>: Abbrev Number: 15 (DW_TAG_formal_parameter)
     <72a>   DW_AT_type        : (ref4) <0x4b9>
  <2><72e>: Abbrev Number: 15 (DW_TAG_formal_parameter)
     <72f>   DW_AT_type        : (ref4) <0x81>, int
  <2><733>: Abbrev Number: 0
  <1><734>: Abbrev Number: 24 (DW_TAG_typedef)
-    <735>   DW_AT_name        : (strp) (offset: 0x245a): getiterfunc
+    <735>   DW_AT_name        : (strp) (offset: 0x247c): getiterfunc
     <739>   DW_AT_decl_file   : (data1) 2
     <73a>   DW_AT_decl_line   : (data1) 209
     <73b>   DW_AT_decl_column : (data1) 21
     <73c>   DW_AT_type        : (ref4) <0x4a5>
  <1><740>: Abbrev Number: 24 (DW_TAG_typedef)
-    <741>   DW_AT_name        : (strp) (offset: 0x6321): iternextfunc
+    <741>   DW_AT_name        : (strp) (offset: 0x6325): iternextfunc
     <745>   DW_AT_decl_file   : (data1) 2
     <746>   DW_AT_decl_line   : (data1) 210
     <747>   DW_AT_decl_column : (data1) 21
     <748>   DW_AT_type        : (ref4) <0x4a5>
  <1><74c>: Abbrev Number: 24 (DW_TAG_typedef)
     <74d>   DW_AT_name        : (strp) (offset: 0x260b): descrgetfunc
     <751>   DW_AT_decl_file   : (data1) 2
@@ -962,15 +962,15 @@
  <1><764>: Abbrev Number: 24 (DW_TAG_typedef)
     <765>   DW_AT_name        : (strp) (offset: 0x7a1): initproc
     <769>   DW_AT_decl_file   : (data1) 2
     <76a>   DW_AT_decl_line   : (data1) 213
     <76b>   DW_AT_decl_column : (data1) 15
     <76c>   DW_AT_type        : (ref4) <0x5ad>
  <1><770>: Abbrev Number: 24 (DW_TAG_typedef)
-    <771>   DW_AT_name        : (strp) (offset: 0x4841): newfunc
+    <771>   DW_AT_name        : (strp) (offset: 0x4821): newfunc
     <775>   DW_AT_decl_file   : (data1) 2
     <776>   DW_AT_decl_line   : (data1) 214
     <777>   DW_AT_decl_column : (data1) 21
     <778>   DW_AT_type        : (ref4) <0x77c>
  <1><77c>: Abbrev Number: 26 (DW_TAG_pointer_type)
     <77d>   DW_AT_byte_size   : (implicit_const) 8
     <77d>   DW_AT_type        : (ref4) <0x781>
@@ -982,15 +982,15 @@
     <78b>   DW_AT_type        : (ref4) <0x453>
  <2><78f>: Abbrev Number: 15 (DW_TAG_formal_parameter)
     <790>   DW_AT_type        : (ref4) <0x4b9>
  <2><794>: Abbrev Number: 15 (DW_TAG_formal_parameter)
     <795>   DW_AT_type        : (ref4) <0x4b9>
  <2><799>: Abbrev Number: 0
  <1><79a>: Abbrev Number: 24 (DW_TAG_typedef)
-    <79b>   DW_AT_name        : (strp) (offset: 0x3c9b): allocfunc
+    <79b>   DW_AT_name        : (strp) (offset: 0x3c7b): allocfunc
     <79f>   DW_AT_decl_file   : (data1) 2
     <7a0>   DW_AT_decl_line   : (data1) 215
     <7a1>   DW_AT_decl_column : (data1) 21
     <7a2>   DW_AT_type        : (ref4) <0x7a6>
  <1><7a6>: Abbrev Number: 26 (DW_TAG_pointer_type)
     <7a7>   DW_AT_byte_size   : (implicit_const) 8
     <7a7>   DW_AT_type        : (ref4) <0x7ab>
@@ -1000,15 +1000,15 @@
     <7b0>   DW_AT_sibling     : (ref4) <0x7bf>
  <2><7b4>: Abbrev Number: 15 (DW_TAG_formal_parameter)
     <7b5>   DW_AT_type        : (ref4) <0x453>
  <2><7b9>: Abbrev Number: 15 (DW_TAG_formal_parameter)
     <7ba>   DW_AT_type        : (ref4) <0x158>, Py_ssize_t, ssize_t, __ssize_t, long int
  <2><7be>: Abbrev Number: 0
  <1><7bf>: Abbrev Number: 45 (DW_TAG_variable)
-    <7c0>   DW_AT_name        : (strp) (offset: 0x6086): PyType_Type
+    <7c0>   DW_AT_name        : (strp) (offset: 0x608a): PyType_Type
     <7c4>   DW_AT_decl_file   : (data1) 2
     <7c5>   DW_AT_decl_line   : (data1) 251
     <7c6>   DW_AT_decl_column : (data1) 26
     <7c7>   DW_AT_type        : (ref4) <0x17c>, PyTypeObject, _typeobject
     <7cb>   DW_AT_external    : (flag_present) 1
     <7cb>   DW_AT_declaration : (flag_present) 1
  <1><7cb>: Abbrev Number: 45 (DW_TAG_variable)
@@ -1016,15 +1016,15 @@
     <7d0>   DW_AT_decl_file   : (data1) 2
     <7d1>   DW_AT_decl_line   : (data1) 252
     <7d2>   DW_AT_decl_column : (data1) 26
     <7d3>   DW_AT_type        : (ref4) <0x17c>, PyTypeObject, _typeobject
     <7d7>   DW_AT_external    : (flag_present) 1
     <7d7>   DW_AT_declaration : (flag_present) 1
  <1><7d7>: Abbrev Number: 91 (DW_TAG_variable)
-    <7d8>   DW_AT_name        : (strp) (offset: 0x5d73): _Py_NoneStruct
+    <7d8>   DW_AT_name        : (strp) (offset: 0x5d53): _Py_NoneStruct
     <7dc>   DW_AT_decl_file   : (data1) 2
     <7dd>   DW_AT_decl_line   : (data2) 605
     <7df>   DW_AT_decl_column : (data1) 22
     <7e0>   DW_AT_type        : (ref4) <0x458>, PyObject, _object
     <7e4>   DW_AT_external    : (flag_present) 1
     <7e4>   DW_AT_declaration : (flag_present) 1
  <1><7e4>: Abbrev Number: 103 (DW_TAG_enumeration_type)
@@ -1032,31 +1032,31 @@
     <7e6>   DW_AT_byte_size   : (data1) 4
     <7e7>   DW_AT_type        : (ref4) <0x81>, int
     <7eb>   DW_AT_decl_file   : (data1) 2
     <7ec>   DW_AT_decl_line   : (data2) 635
     <7ee>   DW_AT_decl_column : (data1) 14
     <7ef>   DW_AT_sibling     : (ref4) <0x806>
  <2><7f3>: Abbrev Number: 70 (DW_TAG_enumerator)
-    <7f4>   DW_AT_name        : (strp) (offset: 0x4166): PYGEN_RETURN
+    <7f4>   DW_AT_name        : (strp) (offset: 0x4146): PYGEN_RETURN
     <7f8>   DW_AT_const_value : (data1) 0
  <2><7f9>: Abbrev Number: 104 (DW_TAG_enumerator)
-    <7fa>   DW_AT_name        : (strp) (offset: 0x5cc1): PYGEN_ERROR
+    <7fa>   DW_AT_name        : (strp) (offset: 0x5ca1): PYGEN_ERROR
     <7fe>   DW_AT_const_value : (sdata) -1
  <2><7ff>: Abbrev Number: 70 (DW_TAG_enumerator)
-    <800>   DW_AT_name        : (strp) (offset: 0x662b): PYGEN_NEXT
+    <800>   DW_AT_name        : (strp) (offset: 0x662f): PYGEN_NEXT
     <804>   DW_AT_const_value : (data1) 1
  <2><805>: Abbrev Number: 0
  <1><806>: Abbrev Number: 72 (DW_TAG_typedef)
-    <807>   DW_AT_name        : (strp) (offset: 0x4378): PySendResult
+    <807>   DW_AT_name        : (strp) (offset: 0x4358): PySendResult
     <80b>   DW_AT_decl_file   : (data1) 2
     <80c>   DW_AT_decl_line   : (data2) 639
     <80e>   DW_AT_decl_column : (data1) 3
     <80f>   DW_AT_type        : (ref4) <0x7e4>, int
  <1><813>: Abbrev Number: 58 (DW_TAG_structure_type)
-    <814>   DW_AT_name        : (strp) (offset: 0x47c9): bufferinfo
+    <814>   DW_AT_name        : (strp) (offset: 0x47a9): bufferinfo
     <818>   DW_AT_byte_size   : (data1) 80
     <819>   DW_AT_decl_file   : (data1) 9
     <81a>   DW_AT_decl_line   : (data1) 49
     <81b>   DW_AT_decl_column : (data1) 16
     <81c>   DW_AT_sibling     : (ref4) <0x8b0>
  <2><820>: Abbrev Number: 68 (DW_TAG_member)
     <821>   DW_AT_name        : (string) buf
@@ -1083,74 +1083,74 @@
     <848>   DW_AT_name        : (strp) (offset: 0x629): itemsize
     <84c>   DW_AT_decl_file   : (data1) 9
     <84d>   DW_AT_decl_line   : (data1) 53
     <84e>   DW_AT_decl_column : (data1) 16
     <84f>   DW_AT_type        : (ref4) <0x158>, Py_ssize_t, ssize_t, __ssize_t, long int
     <853>   DW_AT_data_member_location: (data1) 24
  <2><854>: Abbrev Number: 14 (DW_TAG_member)
-    <855>   DW_AT_name        : (strp) (offset: 0x4520): readonly
+    <855>   DW_AT_name        : (strp) (offset: 0x4500): readonly
     <859>   DW_AT_decl_file   : (data1) 9
     <85a>   DW_AT_decl_line   : (data1) 55
     <85b>   DW_AT_decl_column : (data1) 9
     <85c>   DW_AT_type        : (ref4) <0x81>, int
     <860>   DW_AT_data_member_location: (data1) 32
  <2><861>: Abbrev Number: 14 (DW_TAG_member)
-    <862>   DW_AT_name        : (strp) (offset: 0x4b0b): ndim
+    <862>   DW_AT_name        : (strp) (offset: 0x4aeb): ndim
     <866>   DW_AT_decl_file   : (data1) 9
     <867>   DW_AT_decl_line   : (data1) 56
     <868>   DW_AT_decl_column : (data1) 9
     <869>   DW_AT_type        : (ref4) <0x81>, int
     <86d>   DW_AT_data_member_location: (data1) 36
  <2><86e>: Abbrev Number: 14 (DW_TAG_member)
     <86f>   DW_AT_name        : (strp) (offset: 0x1575): format
     <873>   DW_AT_decl_file   : (data1) 9
     <874>   DW_AT_decl_line   : (data1) 57
     <875>   DW_AT_decl_column : (data1) 11
     <876>   DW_AT_type        : (ref4) <0xc4>
     <87a>   DW_AT_data_member_location: (data1) 40
  <2><87b>: Abbrev Number: 14 (DW_TAG_member)
-    <87c>   DW_AT_name        : (strp) (offset: 0x4a85): shape
+    <87c>   DW_AT_name        : (strp) (offset: 0x4a65): shape
     <880>   DW_AT_decl_file   : (data1) 9
     <881>   DW_AT_decl_line   : (data1) 58
     <882>   DW_AT_decl_column : (data1) 17
     <883>   DW_AT_type        : (ref4) <0x8b0>
     <887>   DW_AT_data_member_location: (data1) 48
  <2><888>: Abbrev Number: 14 (DW_TAG_member)
-    <889>   DW_AT_name        : (strp) (offset: 0x53f3): strides
+    <889>   DW_AT_name        : (strp) (offset: 0x53d3): strides
     <88d>   DW_AT_decl_file   : (data1) 9
     <88e>   DW_AT_decl_line   : (data1) 59
     <88f>   DW_AT_decl_column : (data1) 17
     <890>   DW_AT_type        : (ref4) <0x8b0>
     <894>   DW_AT_data_member_location: (data1) 56
  <2><895>: Abbrev Number: 14 (DW_TAG_member)
-    <896>   DW_AT_name        : (strp) (offset: 0x39fd): suboffsets
+    <896>   DW_AT_name        : (strp) (offset: 0x39dd): suboffsets
     <89a>   DW_AT_decl_file   : (data1) 9
     <89b>   DW_AT_decl_line   : (data1) 60
     <89c>   DW_AT_decl_column : (data1) 17
     <89d>   DW_AT_type        : (ref4) <0x8b0>
     <8a1>   DW_AT_data_member_location: (data1) 64
  <2><8a2>: Abbrev Number: 14 (DW_TAG_member)
-    <8a3>   DW_AT_name        : (strp) (offset: 0x5a20): internal
+    <8a3>   DW_AT_name        : (strp) (offset: 0x5a00): internal
     <8a7>   DW_AT_decl_file   : (data1) 9
     <8a8>   DW_AT_decl_line   : (data1) 61
     <8a9>   DW_AT_decl_column : (data1) 11
     <8aa>   DW_AT_type        : (ref4) <0x4b>
     <8ae>   DW_AT_data_member_location: (data1) 72
  <2><8af>: Abbrev Number: 0
  <1><8b0>: Abbrev Number: 26 (DW_TAG_pointer_type)
     <8b1>   DW_AT_byte_size   : (implicit_const) 8
     <8b1>   DW_AT_type        : (ref4) <0x158>, Py_ssize_t, ssize_t, __ssize_t, long int
  <1><8b5>: Abbrev Number: 24 (DW_TAG_typedef)
-    <8b6>   DW_AT_name        : (strp) (offset: 0x6442): Py_buffer
+    <8b6>   DW_AT_name        : (strp) (offset: 0x6446): Py_buffer
     <8ba>   DW_AT_decl_file   : (data1) 9
     <8bb>   DW_AT_decl_line   : (data1) 62
     <8bc>   DW_AT_decl_column : (data1) 3
     <8bd>   DW_AT_type        : (ref4) <0x813>, bufferinfo
  <1><8c1>: Abbrev Number: 24 (DW_TAG_typedef)
-    <8c2>   DW_AT_name        : (strp) (offset: 0x4cc6): getbufferproc
+    <8c2>   DW_AT_name        : (strp) (offset: 0x4ca6): getbufferproc
     <8c6>   DW_AT_decl_file   : (data1) 9
     <8c7>   DW_AT_decl_line   : (data1) 64
     <8c8>   DW_AT_decl_column : (data1) 15
     <8c9>   DW_AT_type        : (ref4) <0x8cd>
  <1><8cd>: Abbrev Number: 26 (DW_TAG_pointer_type)
     <8ce>   DW_AT_byte_size   : (implicit_const) 8
     <8ce>   DW_AT_type        : (ref4) <0x8d2>, int
@@ -1165,15 +1165,15 @@
  <2><8e5>: Abbrev Number: 15 (DW_TAG_formal_parameter)
     <8e6>   DW_AT_type        : (ref4) <0x81>, int
  <2><8ea>: Abbrev Number: 0
  <1><8eb>: Abbrev Number: 26 (DW_TAG_pointer_type)
     <8ec>   DW_AT_byte_size   : (implicit_const) 8
     <8ec>   DW_AT_type        : (ref4) <0x8b5>, Py_buffer, bufferinfo
  <1><8f0>: Abbrev Number: 24 (DW_TAG_typedef)
-    <8f1>   DW_AT_name        : (strp) (offset: 0x564d): releasebufferproc
+    <8f1>   DW_AT_name        : (strp) (offset: 0x562d): releasebufferproc
     <8f5>   DW_AT_decl_file   : (data1) 9
     <8f6>   DW_AT_decl_line   : (data1) 65
     <8f7>   DW_AT_decl_column : (data1) 16
     <8f8>   DW_AT_type        : (ref4) <0x8fc>
  <1><8fc>: Abbrev Number: 26 (DW_TAG_pointer_type)
     <8fd>   DW_AT_byte_size   : (implicit_const) 8
     <8fd>   DW_AT_type        : (ref4) <0x901>
@@ -1182,15 +1182,15 @@
     <902>   DW_AT_sibling     : (ref4) <0x911>
  <2><906>: Abbrev Number: 15 (DW_TAG_formal_parameter)
     <907>   DW_AT_type        : (ref4) <0x4b9>
  <2><90b>: Abbrev Number: 15 (DW_TAG_formal_parameter)
     <90c>   DW_AT_type        : (ref4) <0x8eb>
  <2><910>: Abbrev Number: 0
  <1><911>: Abbrev Number: 24 (DW_TAG_typedef)
-    <912>   DW_AT_name        : (strp) (offset: 0x23f0): vectorcallfunc
+    <912>   DW_AT_name        : (strp) (offset: 0x2412): vectorcallfunc
     <916>   DW_AT_decl_file   : (data1) 9
     <917>   DW_AT_decl_line   : (data1) 67
     <918>   DW_AT_decl_column : (data1) 21
     <919>   DW_AT_type        : (ref4) <0x91d>
  <1><91d>: Abbrev Number: 26 (DW_TAG_pointer_type)
     <91e>   DW_AT_byte_size   : (implicit_const) 8
     <91e>   DW_AT_type        : (ref4) <0x922>
@@ -1220,36 +1220,36 @@
     <950>   DW_AT_name        : (strp) (offset: 0x282): nb_add
     <954>   DW_AT_decl_file   : (data1) 9
     <955>   DW_AT_decl_line   : (data1) 109
     <956>   DW_AT_decl_column : (data1) 16
     <957>   DW_AT_type        : (ref4) <0x4c3>, binaryfunc
     <95b>   DW_AT_data_member_location: (data1) 0
  <2><95c>: Abbrev Number: 14 (DW_TAG_member)
-    <95d>   DW_AT_name        : (strp) (offset: 0x607a): nb_subtract
+    <95d>   DW_AT_name        : (strp) (offset: 0x607e): nb_subtract
     <961>   DW_AT_decl_file   : (data1) 9
     <962>   DW_AT_decl_line   : (data1) 110
     <963>   DW_AT_decl_column : (data1) 16
     <964>   DW_AT_type        : (ref4) <0x4c3>, binaryfunc
     <968>   DW_AT_data_member_location: (data1) 8
  <2><969>: Abbrev Number: 14 (DW_TAG_member)
-    <96a>   DW_AT_name        : (strp) (offset: 0x514b): nb_multiply
+    <96a>   DW_AT_name        : (strp) (offset: 0x512b): nb_multiply
     <96e>   DW_AT_decl_file   : (data1) 9
     <96f>   DW_AT_decl_line   : (data1) 111
     <970>   DW_AT_decl_column : (data1) 16
     <971>   DW_AT_type        : (ref4) <0x4c3>, binaryfunc
     <975>   DW_AT_data_member_location: (data1) 16
  <2><976>: Abbrev Number: 14 (DW_TAG_member)
     <977>   DW_AT_name        : (strp) (offset: 0x106e): nb_remainder
     <97b>   DW_AT_decl_file   : (data1) 9
     <97c>   DW_AT_decl_line   : (data1) 112
     <97d>   DW_AT_decl_column : (data1) 16
     <97e>   DW_AT_type        : (ref4) <0x4c3>, binaryfunc
     <982>   DW_AT_data_member_location: (data1) 24
  <2><983>: Abbrev Number: 14 (DW_TAG_member)
-    <984>   DW_AT_name        : (strp) (offset: 0x6621): nb_divmod
+    <984>   DW_AT_name        : (strp) (offset: 0x6625): nb_divmod
     <988>   DW_AT_decl_file   : (data1) 9
     <989>   DW_AT_decl_line   : (data1) 113
     <98a>   DW_AT_decl_column : (data1) 16
     <98b>   DW_AT_type        : (ref4) <0x4c3>, binaryfunc
     <98f>   DW_AT_data_member_location: (data1) 32
  <2><990>: Abbrev Number: 14 (DW_TAG_member)
     <991>   DW_AT_name        : (strp) (offset: 0x434): nb_power
@@ -1262,50 +1262,50 @@
     <99e>   DW_AT_name        : (strp) (offset: 0x2ea5): nb_negative
     <9a2>   DW_AT_decl_file   : (data1) 9
     <9a3>   DW_AT_decl_line   : (data1) 115
     <9a4>   DW_AT_decl_column : (data1) 15
     <9a5>   DW_AT_type        : (ref4) <0x499>, unaryfunc
     <9a9>   DW_AT_data_member_location: (data1) 48
  <2><9aa>: Abbrev Number: 14 (DW_TAG_member)
-    <9ab>   DW_AT_name        : (strp) (offset: 0x5d39): nb_positive
+    <9ab>   DW_AT_name        : (strp) (offset: 0x5d19): nb_positive
     <9af>   DW_AT_decl_file   : (data1) 9
     <9b0>   DW_AT_decl_line   : (data1) 116
     <9b1>   DW_AT_decl_column : (data1) 15
     <9b2>   DW_AT_type        : (ref4) <0x499>, unaryfunc
     <9b6>   DW_AT_data_member_location: (data1) 56
  <2><9b7>: Abbrev Number: 14 (DW_TAG_member)
-    <9b8>   DW_AT_name        : (strp) (offset: 0x5901): nb_absolute
+    <9b8>   DW_AT_name        : (strp) (offset: 0x58e1): nb_absolute
     <9bc>   DW_AT_decl_file   : (data1) 9
     <9bd>   DW_AT_decl_line   : (data1) 117
     <9be>   DW_AT_decl_column : (data1) 15
     <9bf>   DW_AT_type        : (ref4) <0x499>, unaryfunc
     <9c3>   DW_AT_data_member_location: (data1) 64
  <2><9c4>: Abbrev Number: 14 (DW_TAG_member)
-    <9c5>   DW_AT_name        : (strp) (offset: 0x1e9a): nb_bool
+    <9c5>   DW_AT_name        : (strp) (offset: 0x1ebc): nb_bool
     <9c9>   DW_AT_decl_file   : (data1) 9
     <9ca>   DW_AT_decl_line   : (data1) 118
     <9cb>   DW_AT_decl_column : (data1) 13
     <9cc>   DW_AT_type        : (ref4) <0x512>, inquiry
     <9d0>   DW_AT_data_member_location: (data1) 72
  <2><9d1>: Abbrev Number: 14 (DW_TAG_member)
-    <9d2>   DW_AT_name        : (strp) (offset: 0x423b): nb_invert
+    <9d2>   DW_AT_name        : (strp) (offset: 0x421b): nb_invert
     <9d6>   DW_AT_decl_file   : (data1) 9
     <9d7>   DW_AT_decl_line   : (data1) 119
     <9d8>   DW_AT_decl_column : (data1) 15
     <9d9>   DW_AT_type        : (ref4) <0x499>, unaryfunc
     <9dd>   DW_AT_data_member_location: (data1) 80
  <2><9de>: Abbrev Number: 14 (DW_TAG_member)
     <9df>   DW_AT_name        : (strp) (offset: 0x3bf): nb_lshift
     <9e3>   DW_AT_decl_file   : (data1) 9
     <9e4>   DW_AT_decl_line   : (data1) 120
     <9e5>   DW_AT_decl_column : (data1) 16
     <9e6>   DW_AT_type        : (ref4) <0x4c3>, binaryfunc
     <9ea>   DW_AT_data_member_location: (data1) 88
  <2><9eb>: Abbrev Number: 14 (DW_TAG_member)
-    <9ec>   DW_AT_name        : (strp) (offset: 0x546f): nb_rshift
+    <9ec>   DW_AT_name        : (strp) (offset: 0x544f): nb_rshift
     <9f0>   DW_AT_decl_file   : (data1) 9
     <9f1>   DW_AT_decl_line   : (data1) 121
     <9f2>   DW_AT_decl_column : (data1) 16
     <9f3>   DW_AT_type        : (ref4) <0x4c3>, binaryfunc
     <9f7>   DW_AT_data_member_location: (data1) 96
  <2><9f8>: Abbrev Number: 14 (DW_TAG_member)
     <9f9>   DW_AT_name        : (strp) (offset: 0x14a6): nb_and
@@ -1318,127 +1318,127 @@
     <a06>   DW_AT_name        : (strp) (offset: 0x2db3): nb_xor
     <a0a>   DW_AT_decl_file   : (data1) 9
     <a0b>   DW_AT_decl_line   : (data1) 123
     <a0c>   DW_AT_decl_column : (data1) 16
     <a0d>   DW_AT_type        : (ref4) <0x4c3>, binaryfunc
     <a11>   DW_AT_data_member_location: (data1) 112
  <2><a12>: Abbrev Number: 14 (DW_TAG_member)
-    <a13>   DW_AT_name        : (strp) (offset: 0x3fc8): nb_or
+    <a13>   DW_AT_name        : (strp) (offset: 0x3fa8): nb_or
     <a17>   DW_AT_decl_file   : (data1) 9
     <a18>   DW_AT_decl_line   : (data1) 124
     <a19>   DW_AT_decl_column : (data1) 16
     <a1a>   DW_AT_type        : (ref4) <0x4c3>, binaryfunc
     <a1e>   DW_AT_data_member_location: (data1) 120
  <2><a1f>: Abbrev Number: 14 (DW_TAG_member)
-    <a20>   DW_AT_name        : (strp) (offset: 0x63ca): nb_int
+    <a20>   DW_AT_name        : (strp) (offset: 0x63ce): nb_int
     <a24>   DW_AT_decl_file   : (data1) 9
     <a25>   DW_AT_decl_line   : (data1) 125
     <a26>   DW_AT_decl_column : (data1) 15
     <a27>   DW_AT_type        : (ref4) <0x499>, unaryfunc
     <a2b>   DW_AT_data_member_location: (data1) 128
  <2><a2c>: Abbrev Number: 14 (DW_TAG_member)
     <a2d>   DW_AT_name        : (strp) (offset: 0x26ca): nb_reserved
     <a31>   DW_AT_decl_file   : (data1) 9
     <a32>   DW_AT_decl_line   : (data1) 126
     <a33>   DW_AT_decl_column : (data1) 11
     <a34>   DW_AT_type        : (ref4) <0x4b>
     <a38>   DW_AT_data_member_location: (data1) 136
  <2><a39>: Abbrev Number: 14 (DW_TAG_member)
-    <a3a>   DW_AT_name        : (strp) (offset: 0x409a): nb_float
+    <a3a>   DW_AT_name        : (strp) (offset: 0x407a): nb_float
     <a3e>   DW_AT_decl_file   : (data1) 9
     <a3f>   DW_AT_decl_line   : (data1) 127
     <a40>   DW_AT_decl_column : (data1) 15
     <a41>   DW_AT_type        : (ref4) <0x499>, unaryfunc
     <a45>   DW_AT_data_member_location: (data1) 144
  <2><a46>: Abbrev Number: 14 (DW_TAG_member)
     <a47>   DW_AT_name        : (strp) (offset: 0x269a): nb_inplace_add
     <a4b>   DW_AT_decl_file   : (data1) 9
     <a4c>   DW_AT_decl_line   : (data1) 129
     <a4d>   DW_AT_decl_column : (data1) 16
     <a4e>   DW_AT_type        : (ref4) <0x4c3>, binaryfunc
     <a52>   DW_AT_data_member_location: (data1) 152
  <2><a53>: Abbrev Number: 14 (DW_TAG_member)
-    <a54>   DW_AT_name        : (strp) (offset: 0x6550): nb_inplace_subtract
+    <a54>   DW_AT_name        : (strp) (offset: 0x6554): nb_inplace_subtract
     <a58>   DW_AT_decl_file   : (data1) 9
     <a59>   DW_AT_decl_line   : (data1) 130
     <a5a>   DW_AT_decl_column : (data1) 16
     <a5b>   DW_AT_type        : (ref4) <0x4c3>, binaryfunc
     <a5f>   DW_AT_data_member_location: (data1) 160
  <2><a60>: Abbrev Number: 14 (DW_TAG_member)
-    <a61>   DW_AT_name        : (strp) (offset: 0x5629): nb_inplace_multiply
+    <a61>   DW_AT_name        : (strp) (offset: 0x5609): nb_inplace_multiply
     <a65>   DW_AT_decl_file   : (data1) 9
     <a66>   DW_AT_decl_line   : (data1) 131
     <a67>   DW_AT_decl_column : (data1) 16
     <a68>   DW_AT_type        : (ref4) <0x4c3>, binaryfunc
     <a6c>   DW_AT_data_member_location: (data1) 168
  <2><a6d>: Abbrev Number: 14 (DW_TAG_member)
-    <a6e>   DW_AT_name        : (strp) (offset: 0x569a): nb_inplace_remainder
+    <a6e>   DW_AT_name        : (strp) (offset: 0x567a): nb_inplace_remainder
     <a72>   DW_AT_decl_file   : (data1) 9
     <a73>   DW_AT_decl_line   : (data1) 132
     <a74>   DW_AT_decl_column : (data1) 16
     <a75>   DW_AT_type        : (ref4) <0x4c3>, binaryfunc
     <a79>   DW_AT_data_member_location: (data1) 176
  <2><a7a>: Abbrev Number: 14 (DW_TAG_member)
-    <a7b>   DW_AT_name        : (strp) (offset: 0x4fd5): nb_inplace_power
+    <a7b>   DW_AT_name        : (strp) (offset: 0x4fb5): nb_inplace_power
     <a7f>   DW_AT_decl_file   : (data1) 9
     <a80>   DW_AT_decl_line   : (data1) 133
     <a81>   DW_AT_decl_column : (data1) 17
     <a82>   DW_AT_type        : (ref4) <0x4e8>, ternaryfunc
     <a86>   DW_AT_data_member_location: (data1) 184
  <2><a87>: Abbrev Number: 14 (DW_TAG_member)
     <a88>   DW_AT_name        : (strp) (offset: 0xc11): nb_inplace_lshift
     <a8c>   DW_AT_decl_file   : (data1) 9
     <a8d>   DW_AT_decl_line   : (data1) 134
     <a8e>   DW_AT_decl_column : (data1) 16
     <a8f>   DW_AT_type        : (ref4) <0x4c3>, binaryfunc
     <a93>   DW_AT_data_member_location: (data1) 192
  <2><a94>: Abbrev Number: 14 (DW_TAG_member)
-    <a95>   DW_AT_name        : (strp) (offset: 0x5ccd): nb_inplace_rshift
+    <a95>   DW_AT_name        : (strp) (offset: 0x5cad): nb_inplace_rshift
     <a99>   DW_AT_decl_file   : (data1) 9
     <a9a>   DW_AT_decl_line   : (data1) 135
     <a9b>   DW_AT_decl_column : (data1) 16
     <a9c>   DW_AT_type        : (ref4) <0x4c3>, binaryfunc
     <aa0>   DW_AT_data_member_location: (data1) 200
  <2><aa1>: Abbrev Number: 14 (DW_TAG_member)
-    <aa2>   DW_AT_name        : (strp) (offset: 0x37b2): nb_inplace_and
+    <aa2>   DW_AT_name        : (strp) (offset: 0x3792): nb_inplace_and
     <aa6>   DW_AT_decl_file   : (data1) 9
     <aa7>   DW_AT_decl_line   : (data1) 136
     <aa8>   DW_AT_decl_column : (data1) 16
     <aa9>   DW_AT_type        : (ref4) <0x4c3>, binaryfunc
     <aad>   DW_AT_data_member_location: (data1) 208
  <2><aae>: Abbrev Number: 14 (DW_TAG_member)
-    <aaf>   DW_AT_name        : (strp) (offset: 0x4f77): nb_inplace_xor
+    <aaf>   DW_AT_name        : (strp) (offset: 0x4f57): nb_inplace_xor
     <ab3>   DW_AT_decl_file   : (data1) 9
     <ab4>   DW_AT_decl_line   : (data1) 137
     <ab5>   DW_AT_decl_column : (data1) 16
     <ab6>   DW_AT_type        : (ref4) <0x4c3>, binaryfunc
     <aba>   DW_AT_data_member_location: (data1) 216
  <2><abb>: Abbrev Number: 14 (DW_TAG_member)
-    <abc>   DW_AT_name        : (strp) (offset: 0x5af2): nb_inplace_or
+    <abc>   DW_AT_name        : (strp) (offset: 0x5ad2): nb_inplace_or
     <ac0>   DW_AT_decl_file   : (data1) 9
     <ac1>   DW_AT_decl_line   : (data1) 138
     <ac2>   DW_AT_decl_column : (data1) 16
     <ac3>   DW_AT_type        : (ref4) <0x4c3>, binaryfunc
     <ac7>   DW_AT_data_member_location: (data1) 224
  <2><ac8>: Abbrev Number: 14 (DW_TAG_member)
     <ac9>   DW_AT_name        : (strp) (offset: 0xba6): nb_floor_divide
     <acd>   DW_AT_decl_file   : (data1) 9
     <ace>   DW_AT_decl_line   : (data1) 140
     <acf>   DW_AT_decl_column : (data1) 16
     <ad0>   DW_AT_type        : (ref4) <0x4c3>, binaryfunc
     <ad4>   DW_AT_data_member_location: (data1) 232
  <2><ad5>: Abbrev Number: 14 (DW_TAG_member)
-    <ad6>   DW_AT_name        : (strp) (offset: 0x5179): nb_true_divide
+    <ad6>   DW_AT_name        : (strp) (offset: 0x5159): nb_true_divide
     <ada>   DW_AT_decl_file   : (data1) 9
     <adb>   DW_AT_decl_line   : (data1) 141
     <adc>   DW_AT_decl_column : (data1) 16
     <add>   DW_AT_type        : (ref4) <0x4c3>, binaryfunc
     <ae1>   DW_AT_data_member_location: (data1) 240
  <2><ae2>: Abbrev Number: 14 (DW_TAG_member)
-    <ae3>   DW_AT_name        : (strp) (offset: 0x5359): nb_inplace_floor_divide
+    <ae3>   DW_AT_name        : (strp) (offset: 0x5339): nb_inplace_floor_divide
     <ae7>   DW_AT_decl_file   : (data1) 9
     <ae8>   DW_AT_decl_line   : (data1) 142
     <ae9>   DW_AT_decl_column : (data1) 16
     <aea>   DW_AT_type        : (ref4) <0x4c3>, binaryfunc
     <aee>   DW_AT_data_member_location: (data1) 248
  <2><aef>: Abbrev Number: 59 (DW_TAG_member)
     <af0>   DW_AT_name        : (strp) (offset: 0x3404): nb_inplace_true_divide
@@ -1458,15 +1458,15 @@
     <b0c>   DW_AT_name        : (strp) (offset: 0x3ac): nb_matrix_multiply
     <b10>   DW_AT_decl_file   : (data1) 9
     <b11>   DW_AT_decl_line   : (data1) 147
     <b12>   DW_AT_decl_column : (data1) 16
     <b13>   DW_AT_type        : (ref4) <0x4c3>, binaryfunc
     <b17>   DW_AT_data_member_location: (data2) 272
  <2><b19>: Abbrev Number: 59 (DW_TAG_member)
-    <b1a>   DW_AT_name        : (strp) (offset: 0x64e6): nb_inplace_matrix_multiply
+    <b1a>   DW_AT_name        : (strp) (offset: 0x64ea): nb_inplace_matrix_multiply
     <b1e>   DW_AT_decl_file   : (data1) 9
     <b1f>   DW_AT_decl_line   : (data1) 148
     <b20>   DW_AT_decl_column : (data1) 16
     <b21>   DW_AT_type        : (ref4) <0x4c3>, binaryfunc
     <b25>   DW_AT_data_member_location: (data2) 280
  <2><b27>: Abbrev Number: 0
  <1><b28>: Abbrev Number: 24 (DW_TAG_typedef)
@@ -1478,15 +1478,15 @@
  <1><b34>: Abbrev Number: 53 (DW_TAG_structure_type)
     <b35>   DW_AT_byte_size   : (data1) 80
     <b36>   DW_AT_decl_file   : (data1) 9
     <b37>   DW_AT_decl_line   : (data1) 151
     <b38>   DW_AT_decl_column : (data1) 9
     <b39>   DW_AT_sibling     : (ref4) <0xbc0>
  <2><b3d>: Abbrev Number: 14 (DW_TAG_member)
-    <b3e>   DW_AT_name        : (strp) (offset: 0x52ad): sq_length
+    <b3e>   DW_AT_name        : (strp) (offset: 0x528d): sq_length
     <b42>   DW_AT_decl_file   : (data1) 9
     <b43>   DW_AT_decl_line   : (data1) 152
     <b44>   DW_AT_decl_column : (data1) 13
     <b45>   DW_AT_type        : (ref4) <0x532>, lenfunc
     <b49>   DW_AT_data_member_location: (data1) 0
  <2><b4a>: Abbrev Number: 14 (DW_TAG_member)
     <b4b>   DW_AT_name        : (strp) (offset: 0x72d): sq_concat
@@ -1549,27 +1549,27 @@
     <bb7>   DW_AT_decl_file   : (data1) 9
     <bb8>   DW_AT_decl_line   : (data1) 162
     <bb9>   DW_AT_decl_column : (data1) 18
     <bba>   DW_AT_type        : (ref4) <0x552>, ssizeargfunc
     <bbe>   DW_AT_data_member_location: (data1) 72
  <2><bbf>: Abbrev Number: 0
  <1><bc0>: Abbrev Number: 24 (DW_TAG_typedef)
-    <bc1>   DW_AT_name        : (strp) (offset: 0x3b66): PySequenceMethods
+    <bc1>   DW_AT_name        : (strp) (offset: 0x3b46): PySequenceMethods
     <bc5>   DW_AT_decl_file   : (data1) 9
     <bc6>   DW_AT_decl_line   : (data1) 163
     <bc7>   DW_AT_decl_column : (data1) 3
     <bc8>   DW_AT_type        : (ref4) <0xb34>
  <1><bcc>: Abbrev Number: 53 (DW_TAG_structure_type)
     <bcd>   DW_AT_byte_size   : (data1) 24
     <bce>   DW_AT_decl_file   : (data1) 9
     <bcf>   DW_AT_decl_line   : (data1) 165
     <bd0>   DW_AT_decl_column : (data1) 9
     <bd1>   DW_AT_sibling     : (ref4) <0xbfd>
  <2><bd5>: Abbrev Number: 14 (DW_TAG_member)
-    <bd6>   DW_AT_name        : (strp) (offset: 0x4ee3): mp_length
+    <bd6>   DW_AT_name        : (strp) (offset: 0x4ec3): mp_length
     <bda>   DW_AT_decl_file   : (data1) 9
     <bdb>   DW_AT_decl_line   : (data1) 166
     <bdc>   DW_AT_decl_column : (data1) 13
     <bdd>   DW_AT_type        : (ref4) <0x532>, lenfunc
     <be1>   DW_AT_data_member_location: (data1) 0
  <2><be2>: Abbrev Number: 14 (DW_TAG_member)
     <be3>   DW_AT_name        : (strp) (offset: 0x1ca8): mp_subscript
@@ -1583,21 +1583,21 @@
     <bf4>   DW_AT_decl_file   : (data1) 9
     <bf5>   DW_AT_decl_line   : (data1) 168
     <bf6>   DW_AT_decl_column : (data1) 19
     <bf7>   DW_AT_type        : (ref4) <0x5a1>, objobjargproc
     <bfb>   DW_AT_data_member_location: (data1) 16
  <2><bfc>: Abbrev Number: 0
  <1><bfd>: Abbrev Number: 24 (DW_TAG_typedef)
-    <bfe>   DW_AT_name        : (strp) (offset: 0x5dc4): PyMappingMethods
+    <bfe>   DW_AT_name        : (strp) (offset: 0x5da4): PyMappingMethods
     <c02>   DW_AT_decl_file   : (data1) 9
     <c03>   DW_AT_decl_line   : (data1) 169
     <c04>   DW_AT_decl_column : (data1) 3
     <c05>   DW_AT_type        : (ref4) <0xbcc>
  <1><c09>: Abbrev Number: 24 (DW_TAG_typedef)
-    <c0a>   DW_AT_name        : (strp) (offset: 0x4e36): sendfunc
+    <c0a>   DW_AT_name        : (strp) (offset: 0x4e16): sendfunc
     <c0e>   DW_AT_decl_file   : (data1) 9
     <c0f>   DW_AT_decl_line   : (data1) 171
     <c10>   DW_AT_decl_column : (data1) 24
     <c11>   DW_AT_type        : (ref4) <0xc15>
  <1><c15>: Abbrev Number: 26 (DW_TAG_pointer_type)
     <c16>   DW_AT_byte_size   : (implicit_const) 8
     <c16>   DW_AT_type        : (ref4) <0xc1a>, PySendResult, int
@@ -1618,22 +1618,22 @@
  <1><c38>: Abbrev Number: 53 (DW_TAG_structure_type)
     <c39>   DW_AT_byte_size   : (data1) 32
     <c3a>   DW_AT_decl_file   : (data1) 9
     <c3b>   DW_AT_decl_line   : (data1) 173
     <c3c>   DW_AT_decl_column : (data1) 9
     <c3d>   DW_AT_sibling     : (ref4) <0xc76>
  <2><c41>: Abbrev Number: 14 (DW_TAG_member)
-    <c42>   DW_AT_name        : (strp) (offset: 0x4e01): am_await
+    <c42>   DW_AT_name        : (strp) (offset: 0x4de1): am_await
     <c46>   DW_AT_decl_file   : (data1) 9
     <c47>   DW_AT_decl_line   : (data1) 174
     <c48>   DW_AT_decl_column : (data1) 15
     <c49>   DW_AT_type        : (ref4) <0x499>, unaryfunc
     <c4d>   DW_AT_data_member_location: (data1) 0
  <2><c4e>: Abbrev Number: 14 (DW_TAG_member)
-    <c4f>   DW_AT_name        : (strp) (offset: 0x4f54): am_aiter
+    <c4f>   DW_AT_name        : (strp) (offset: 0x4f34): am_aiter
     <c53>   DW_AT_decl_file   : (data1) 9
     <c54>   DW_AT_decl_line   : (data1) 175
     <c55>   DW_AT_decl_column : (data1) 15
     <c56>   DW_AT_type        : (ref4) <0x499>, unaryfunc
     <c5a>   DW_AT_data_member_location: (data1) 8
  <2><c5b>: Abbrev Number: 14 (DW_TAG_member)
     <c5c>   DW_AT_name        : (strp) (offset: 0x521): am_anext
@@ -1647,34 +1647,34 @@
     <c6d>   DW_AT_decl_file   : (data1) 9
     <c6e>   DW_AT_decl_line   : (data1) 177
     <c6f>   DW_AT_decl_column : (data1) 14
     <c70>   DW_AT_type        : (ref4) <0xc09>, sendfunc
     <c74>   DW_AT_data_member_location: (data1) 24
  <2><c75>: Abbrev Number: 0
  <1><c76>: Abbrev Number: 24 (DW_TAG_typedef)
-    <c77>   DW_AT_name        : (strp) (offset: 0x43f9): PyAsyncMethods
+    <c77>   DW_AT_name        : (strp) (offset: 0x43d9): PyAsyncMethods
     <c7b>   DW_AT_decl_file   : (data1) 9
     <c7c>   DW_AT_decl_line   : (data1) 178
     <c7d>   DW_AT_decl_column : (data1) 3
     <c7e>   DW_AT_type        : (ref4) <0xc38>
  <1><c82>: Abbrev Number: 53 (DW_TAG_structure_type)
     <c83>   DW_AT_byte_size   : (data1) 16
     <c84>   DW_AT_decl_file   : (data1) 9
     <c85>   DW_AT_decl_line   : (data1) 180
     <c86>   DW_AT_decl_column : (data1) 9
     <c87>   DW_AT_sibling     : (ref4) <0xca6>
  <2><c8b>: Abbrev Number: 14 (DW_TAG_member)
-    <c8c>   DW_AT_name        : (strp) (offset: 0x23af): bf_getbuffer
+    <c8c>   DW_AT_name        : (strp) (offset: 0x23d1): bf_getbuffer
     <c90>   DW_AT_decl_file   : (data1) 9
     <c91>   DW_AT_decl_line   : (data1) 181
     <c92>   DW_AT_decl_column : (data1) 20
     <c93>   DW_AT_type        : (ref4) <0x8c1>, getbufferproc
     <c97>   DW_AT_data_member_location: (data1) 0
  <2><c98>: Abbrev Number: 14 (DW_TAG_member)
-    <c99>   DW_AT_name        : (strp) (offset: 0x559b): bf_releasebuffer
+    <c99>   DW_AT_name        : (strp) (offset: 0x557b): bf_releasebuffer
     <c9d>   DW_AT_decl_file   : (data1) 9
     <c9e>   DW_AT_decl_line   : (data1) 182
     <c9f>   DW_AT_decl_column : (data1) 24
     <ca0>   DW_AT_type        : (ref4) <0x8f0>, releasebufferproc
     <ca4>   DW_AT_data_member_location: (data1) 8
  <2><ca5>: Abbrev Number: 0
  <1><ca6>: Abbrev Number: 24 (DW_TAG_typedef)
@@ -1702,36 +1702,36 @@
     <ccc>   DW_AT_name        : (strp) (offset: 0x1bc8): PyMethodDef
     <cd0>   DW_AT_byte_size   : (data1) 32
     <cd1>   DW_AT_decl_file   : (data1) 10
     <cd2>   DW_AT_decl_line   : (data1) 35
     <cd3>   DW_AT_decl_column : (data1) 8
     <cd4>   DW_AT_sibling     : (ref4) <0xd0d>
  <2><cd8>: Abbrev Number: 14 (DW_TAG_member)
-    <cd9>   DW_AT_name        : (strp) (offset: 0x429e): ml_name
+    <cd9>   DW_AT_name        : (strp) (offset: 0x427e): ml_name
     <cdd>   DW_AT_decl_file   : (data1) 10
     <cde>   DW_AT_decl_line   : (data1) 36
     <cdf>   DW_AT_decl_column : (data1) 18
     <ce0>   DW_AT_type        : (ref4) <0xe5>
     <ce4>   DW_AT_data_member_location: (data1) 0
  <2><ce5>: Abbrev Number: 14 (DW_TAG_member)
-    <ce6>   DW_AT_name        : (strp) (offset: 0x44ed): ml_meth
+    <ce6>   DW_AT_name        : (strp) (offset: 0x44cd): ml_meth
     <cea>   DW_AT_decl_file   : (data1) 10
     <ceb>   DW_AT_decl_line   : (data1) 37
     <cec>   DW_AT_decl_column : (data1) 17
     <ced>   DW_AT_type        : (ref4) <0x1149>, PyCFunction
     <cf1>   DW_AT_data_member_location: (data1) 8
  <2><cf2>: Abbrev Number: 14 (DW_TAG_member)
     <cf3>   DW_AT_name        : (strp) (offset: 0x32d1): ml_flags
     <cf7>   DW_AT_decl_file   : (data1) 10
     <cf8>   DW_AT_decl_line   : (data1) 38
     <cf9>   DW_AT_decl_column : (data1) 17
     <cfa>   DW_AT_type        : (ref4) <0x81>, int
     <cfe>   DW_AT_data_member_location: (data1) 16
  <2><cff>: Abbrev Number: 14 (DW_TAG_member)
-    <d00>   DW_AT_name        : (strp) (offset: 0x4260): ml_doc
+    <d00>   DW_AT_name        : (strp) (offset: 0x4240): ml_doc
     <d04>   DW_AT_decl_file   : (data1) 10
     <d05>   DW_AT_decl_line   : (data1) 40
     <d06>   DW_AT_decl_column : (data1) 18
     <d07>   DW_AT_type        : (ref4) <0xe5>
     <d0b>   DW_AT_data_member_location: (data1) 24
  <2><d0c>: Abbrev Number: 0
  <1><d0d>: Abbrev Number: 26 (DW_TAG_pointer_type)
@@ -1741,29 +1741,29 @@
     <d13>   DW_AT_name        : (strp) (offset: 0x122b): PyMemberDef
     <d17>   DW_AT_byte_size   : (data1) 40
     <d18>   DW_AT_decl_file   : (data1) 11
     <d19>   DW_AT_decl_line   : (data1) 18
     <d1a>   DW_AT_decl_column : (data1) 16
     <d1b>   DW_AT_sibling     : (ref4) <0xd61>
  <2><d1f>: Abbrev Number: 14 (DW_TAG_member)
-    <d20>   DW_AT_name        : (strp) (offset: 0x4c1e): name
+    <d20>   DW_AT_name        : (strp) (offset: 0x4bfe): name
     <d24>   DW_AT_decl_file   : (data1) 11
     <d25>   DW_AT_decl_line   : (data1) 19
     <d26>   DW_AT_decl_column : (data1) 17
     <d27>   DW_AT_type        : (ref4) <0xe5>
     <d2b>   DW_AT_data_member_location: (data1) 0
  <2><d2c>: Abbrev Number: 14 (DW_TAG_member)
     <d2d>   DW_AT_name        : (strp) (offset: 0x1257): type
     <d31>   DW_AT_decl_file   : (data1) 11
     <d32>   DW_AT_decl_line   : (data1) 20
     <d33>   DW_AT_decl_column : (data1) 9
     <d34>   DW_AT_type        : (ref4) <0x81>, int
     <d38>   DW_AT_data_member_location: (data1) 8
  <2><d39>: Abbrev Number: 14 (DW_TAG_member)
-    <d3a>   DW_AT_name        : (strp) (offset: 0x41d1): offset
+    <d3a>   DW_AT_name        : (strp) (offset: 0x41b1): offset
     <d3e>   DW_AT_decl_file   : (data1) 11
     <d3f>   DW_AT_decl_line   : (data1) 21
     <d40>   DW_AT_decl_column : (data1) 16
     <d41>   DW_AT_type        : (ref4) <0x158>, Py_ssize_t, ssize_t, __ssize_t, long int
     <d45>   DW_AT_data_member_location: (data1) 16
  <2><d46>: Abbrev Number: 14 (DW_TAG_member)
     <d47>   DW_AT_name        : (strp) (offset: 0x32d4): flags
@@ -1787,15 +1787,15 @@
     <d67>   DW_AT_name        : (strp) (offset: 0x831): PyGetSetDef
     <d6b>   DW_AT_byte_size   : (data1) 40
     <d6c>   DW_AT_decl_file   : (data1) 12
     <d6d>   DW_AT_decl_line   : (data1) 11
     <d6e>   DW_AT_decl_column : (data1) 16
     <d6f>   DW_AT_sibling     : (ref4) <0xdb5>
  <2><d73>: Abbrev Number: 14 (DW_TAG_member)
-    <d74>   DW_AT_name        : (strp) (offset: 0x4c1e): name
+    <d74>   DW_AT_name        : (strp) (offset: 0x4bfe): name
     <d78>   DW_AT_decl_file   : (data1) 12
     <d79>   DW_AT_decl_line   : (data1) 12
     <d7a>   DW_AT_decl_column : (data1) 17
     <d7b>   DW_AT_type        : (ref4) <0xe5>
     <d7f>   DW_AT_data_member_location: (data1) 0
  <2><d80>: Abbrev Number: 68 (DW_TAG_member)
     <d81>   DW_AT_name        : (string) get
@@ -1815,15 +1815,15 @@
     <d9b>   DW_AT_name        : (string) doc
     <d9f>   DW_AT_decl_file   : (data1) 12
     <da0>   DW_AT_decl_line   : (data1) 15
     <da1>   DW_AT_decl_column : (data1) 17
     <da2>   DW_AT_type        : (ref4) <0xe5>
     <da6>   DW_AT_data_member_location: (data1) 24
  <2><da7>: Abbrev Number: 14 (DW_TAG_member)
-    <da8>   DW_AT_name        : (strp) (offset: 0x434b): closure
+    <da8>   DW_AT_name        : (strp) (offset: 0x432b): closure
     <dac>   DW_AT_decl_file   : (data1) 12
     <dad>   DW_AT_decl_line   : (data1) 16
     <dae>   DW_AT_decl_column : (data1) 11
     <daf>   DW_AT_type        : (ref4) <0x4b>
     <db3>   DW_AT_data_member_location: (data1) 32
  <2><db4>: Abbrev Number: 0
  <1><db5>: Abbrev Number: 26 (DW_TAG_pointer_type)
@@ -1832,21 +1832,21 @@
  <1><dba>: Abbrev Number: 26 (DW_TAG_pointer_type)
     <dbb>   DW_AT_byte_size   : (implicit_const) 8
     <dbb>   DW_AT_type        : (ref4) <0x18d>, _typeobject
  <1><dbf>: Abbrev Number: 92 (DW_TAG_structure_type)
     <dc0>   DW_AT_name        : (strp) (offset: 0x1db): _dictkeysobject
     <dc4>   DW_AT_declaration : (flag_present) 1
  <1><dc4>: Abbrev Number: 24 (DW_TAG_typedef)
-    <dc5>   DW_AT_name        : (strp) (offset: 0x4e12): Py_UCS4
+    <dc5>   DW_AT_name        : (strp) (offset: 0x4df2): Py_UCS4
     <dc9>   DW_AT_decl_file   : (data1) 13
     <dca>   DW_AT_decl_line   : (data1) 102
     <dcb>   DW_AT_decl_column : (data1) 18
     <dcc>   DW_AT_type        : (ref4) <0x140>, uint32_t, __uint32_t, unsigned int
  <1><dd0>: Abbrev Number: 24 (DW_TAG_typedef)
-    <dd1>   DW_AT_name        : (strp) (offset: 0x4e0a): Py_UCS2
+    <dd1>   DW_AT_name        : (strp) (offset: 0x4dea): Py_UCS2
     <dd5>   DW_AT_decl_file   : (data1) 13
     <dd6>   DW_AT_decl_line   : (data1) 103
     <dd7>   DW_AT_decl_column : (data1) 18
     <dd8>   DW_AT_type        : (ref4) <0x134>, uint16_t, __uint16_t, short unsigned int
  <1><ddc>: Abbrev Number: 24 (DW_TAG_typedef)
     <ddd>   DW_AT_name        : (strp) (offset: 0x2990): Py_UCS1
     <de1>   DW_AT_decl_file   : (data1) 13
@@ -1864,31 +1864,31 @@
  <1><df4>: Abbrev Number: 53 (DW_TAG_structure_type)
     <df5>   DW_AT_byte_size   : (data1) 4
     <df6>   DW_AT_decl_file   : (data1) 14
     <df7>   DW_AT_decl_line   : (data1) 162
     <df8>   DW_AT_decl_column : (data1) 5
     <df9>   DW_AT_sibling     : (ref4) <0xe3a>
  <2><dfd>: Abbrev Number: 73 (DW_TAG_member)
-    <dfe>   DW_AT_name        : (strp) (offset: 0x6052): interned
+    <dfe>   DW_AT_name        : (strp) (offset: 0x6056): interned
     <e02>   DW_AT_decl_file   : (implicit_const) 14
     <e02>   DW_AT_decl_line   : (data1) 171
     <e03>   DW_AT_decl_column : (implicit_const) 22
     <e03>   DW_AT_type        : (ref4) <0x44>, unsigned int
     <e07>   DW_AT_bit_size    : (data1) 2
     <e08>   DW_AT_data_bit_offset: (data1) 0
  <2><e09>: Abbrev Number: 73 (DW_TAG_member)
-    <e0a>   DW_AT_name        : (strp) (offset: 0x566e): kind
+    <e0a>   DW_AT_name        : (strp) (offset: 0x564e): kind
     <e0e>   DW_AT_decl_file   : (implicit_const) 14
     <e0e>   DW_AT_decl_line   : (data1) 199
     <e0f>   DW_AT_decl_column : (implicit_const) 22
     <e0f>   DW_AT_type        : (ref4) <0x44>, unsigned int
     <e13>   DW_AT_bit_size    : (data1) 3
     <e14>   DW_AT_data_bit_offset: (data1) 2
  <2><e15>: Abbrev Number: 73 (DW_TAG_member)
-    <e16>   DW_AT_name        : (strp) (offset: 0x3a08): compact
+    <e16>   DW_AT_name        : (strp) (offset: 0x39e8): compact
     <e1a>   DW_AT_decl_file   : (implicit_const) 14
     <e1a>   DW_AT_decl_line   : (data1) 204
     <e1b>   DW_AT_decl_column : (implicit_const) 22
     <e1b>   DW_AT_type        : (ref4) <0x44>, unsigned int
     <e1f>   DW_AT_bit_size    : (data1) 1
     <e20>   DW_AT_data_bit_offset: (data1) 5
  <2><e21>: Abbrev Number: 73 (DW_TAG_member)
@@ -1896,15 +1896,15 @@
     <e26>   DW_AT_decl_file   : (implicit_const) 14
     <e26>   DW_AT_decl_line   : (data1) 208
     <e27>   DW_AT_decl_column : (implicit_const) 22
     <e27>   DW_AT_type        : (ref4) <0x44>, unsigned int
     <e2b>   DW_AT_bit_size    : (data1) 1
     <e2c>   DW_AT_data_bit_offset: (data1) 6
  <2><e2d>: Abbrev Number: 73 (DW_TAG_member)
-    <e2e>   DW_AT_name        : (strp) (offset: 0x4eed): ready
+    <e2e>   DW_AT_name        : (strp) (offset: 0x4ecd): ready
     <e32>   DW_AT_decl_file   : (implicit_const) 14
     <e32>   DW_AT_decl_line   : (data1) 213
     <e33>   DW_AT_decl_column : (implicit_const) 22
     <e33>   DW_AT_type        : (ref4) <0x44>, unsigned int
     <e37>   DW_AT_bit_size    : (data1) 1
     <e38>   DW_AT_data_bit_offset: (data1) 7
  <2><e39>: Abbrev Number: 0
@@ -1925,22 +1925,22 @@
     <e51>   DW_AT_name        : (strp) (offset: 0x1320): length
     <e55>   DW_AT_decl_file   : (data1) 14
     <e56>   DW_AT_decl_line   : (data1) 160
     <e57>   DW_AT_decl_column : (data1) 16
     <e58>   DW_AT_type        : (ref4) <0x158>, Py_ssize_t, ssize_t, __ssize_t, long int
     <e5c>   DW_AT_data_member_location: (data1) 16
  <2><e5d>: Abbrev Number: 14 (DW_TAG_member)
-    <e5e>   DW_AT_name        : (strp) (offset: 0x4ab4): hash
+    <e5e>   DW_AT_name        : (strp) (offset: 0x4a94): hash
     <e62>   DW_AT_decl_file   : (data1) 14
     <e63>   DW_AT_decl_line   : (data1) 161
     <e64>   DW_AT_decl_column : (data1) 15
     <e65>   DW_AT_type        : (ref4) <0x169>, Py_hash_t, Py_ssize_t, ssize_t, __ssize_t, long int
     <e69>   DW_AT_data_member_location: (data1) 24
  <2><e6a>: Abbrev Number: 14 (DW_TAG_member)
-    <e6b>   DW_AT_name        : (strp) (offset: 0x24d5): state
+    <e6b>   DW_AT_name        : (strp) (offset: 0x24f7): state
     <e6f>   DW_AT_decl_file   : (data1) 14
     <e70>   DW_AT_decl_line   : (data1) 217
     <e71>   DW_AT_decl_column : (data1) 7
     <e72>   DW_AT_type        : (ref4) <0xdf4>
     <e76>   DW_AT_data_member_location: (data1) 32
  <2><e77>: Abbrev Number: 14 (DW_TAG_member)
     <e78>   DW_AT_name        : (strp) (offset: 0xf16): wstr
@@ -1950,15 +1950,15 @@
     <e7f>   DW_AT_type        : (ref4) <0xe85>
     <e83>   DW_AT_data_member_location: (data1) 40
  <2><e84>: Abbrev Number: 0
  <1><e85>: Abbrev Number: 26 (DW_TAG_pointer_type)
     <e86>   DW_AT_byte_size   : (implicit_const) 8
     <e86>   DW_AT_type        : (ref4) <0xf6>, wchar_t, int
  <1><e8a>: Abbrev Number: 24 (DW_TAG_typedef)
-    <e8b>   DW_AT_name        : (strp) (offset: 0x553f): PyASCIIObject
+    <e8b>   DW_AT_name        : (strp) (offset: 0x551f): PyASCIIObject
     <e8f>   DW_AT_decl_file   : (data1) 14
     <e90>   DW_AT_decl_line   : (data1) 219
     <e91>   DW_AT_decl_column : (data1) 3
     <e92>   DW_AT_type        : (ref4) <0xe3a>
  <1><e96>: Abbrev Number: 53 (DW_TAG_structure_type)
     <e97>   DW_AT_byte_size   : (data1) 72
     <e98>   DW_AT_decl_file   : (data1) 14
@@ -1983,15 +1983,15 @@
     <eba>   DW_AT_name        : (strp) (offset: 0x27d): utf8
     <ebe>   DW_AT_decl_file   : (data1) 14
     <ebf>   DW_AT_decl_line   : (data1) 228
     <ec0>   DW_AT_decl_column : (data1) 11
     <ec1>   DW_AT_type        : (ref4) <0xc4>
     <ec5>   DW_AT_data_member_location: (data1) 56
  <2><ec6>: Abbrev Number: 14 (DW_TAG_member)
-    <ec7>   DW_AT_name        : (strp) (offset: 0x4a3e): wstr_length
+    <ec7>   DW_AT_name        : (strp) (offset: 0x4a1e): wstr_length
     <ecb>   DW_AT_decl_file   : (data1) 14
     <ecc>   DW_AT_decl_line   : (data1) 229
     <ecd>   DW_AT_decl_column : (data1) 16
     <ece>   DW_AT_type        : (ref4) <0x158>, Py_ssize_t, ssize_t, __ssize_t, long int
     <ed2>   DW_AT_data_member_location: (data1) 64
  <2><ed3>: Abbrev Number: 0
  <1><ed4>: Abbrev Number: 24 (DW_TAG_typedef)
@@ -2009,27 +2009,27 @@
  <2><ee9>: Abbrev Number: 107 (DW_TAG_member)
     <eea>   DW_AT_name        : (string) any
     <eee>   DW_AT_decl_file   : (data1) 14
     <eef>   DW_AT_decl_line   : (data1) 239
     <ef0>   DW_AT_decl_column : (data1) 15
     <ef1>   DW_AT_type        : (ref4) <0x4b>
  <2><ef5>: Abbrev Number: 80 (DW_TAG_member)
-    <ef6>   DW_AT_name        : (strp) (offset: 0x5199): latin1
+    <ef6>   DW_AT_name        : (strp) (offset: 0x5179): latin1
     <efa>   DW_AT_decl_file   : (implicit_const) 14
     <efa>   DW_AT_decl_line   : (data1) 240
     <efb>   DW_AT_decl_column : (implicit_const) 18
     <efb>   DW_AT_type        : (ref4) <0xf14>
  <2><eff>: Abbrev Number: 80 (DW_TAG_member)
-    <f00>   DW_AT_name        : (strp) (offset: 0x3dd7): ucs2
+    <f00>   DW_AT_name        : (strp) (offset: 0x3db7): ucs2
     <f04>   DW_AT_decl_file   : (implicit_const) 14
     <f04>   DW_AT_decl_line   : (data1) 241
     <f05>   DW_AT_decl_column : (implicit_const) 18
     <f05>   DW_AT_type        : (ref4) <0xf19>
  <2><f09>: Abbrev Number: 80 (DW_TAG_member)
-    <f0a>   DW_AT_name        : (strp) (offset: 0x3ddc): ucs4
+    <f0a>   DW_AT_name        : (strp) (offset: 0x3dbc): ucs4
     <f0e>   DW_AT_decl_file   : (implicit_const) 14
     <f0e>   DW_AT_decl_line   : (data1) 242
     <f0f>   DW_AT_decl_column : (implicit_const) 18
     <f0f>   DW_AT_type        : (ref4) <0xf1e>
  <2><f13>: Abbrev Number: 0
  <1><f14>: Abbrev Number: 26 (DW_TAG_pointer_type)
     <f15>   DW_AT_byte_size   : (implicit_const) 8
@@ -2050,47 +2050,47 @@
     <f2d>   DW_AT_name        : (strp) (offset: 0x174b): _base
     <f31>   DW_AT_decl_file   : (data1) 14
     <f32>   DW_AT_decl_line   : (data1) 237
     <f33>   DW_AT_decl_column : (data1) 28
     <f34>   DW_AT_type        : (ref4) <0xed4>, PyCompactUnicodeObject
     <f38>   DW_AT_data_member_location: (data1) 0
  <2><f39>: Abbrev Number: 14 (DW_TAG_member)
-    <f3a>   DW_AT_name        : (strp) (offset: 0x478d): data
+    <f3a>   DW_AT_name        : (strp) (offset: 0x476d): data
     <f3e>   DW_AT_decl_file   : (data1) 14
     <f3f>   DW_AT_decl_line   : (data1) 243
     <f40>   DW_AT_decl_column : (data1) 7
     <f41>   DW_AT_type        : (ref4) <0xee0>
     <f45>   DW_AT_data_member_location: (data1) 72
  <2><f46>: Abbrev Number: 0
  <1><f47>: Abbrev Number: 24 (DW_TAG_typedef)
     <f48>   DW_AT_name        : (strp) (offset: 0x3533): PyUnicodeObject
     <f4c>   DW_AT_decl_file   : (data1) 14
     <f4d>   DW_AT_decl_line   : (data1) 244
     <f4e>   DW_AT_decl_column : (data1) 3
     <f4f>   DW_AT_type        : (ref4) <0xf23>
  <1><f53>: Abbrev Number: 108 (DW_TAG_enumeration_type)
-    <f54>   DW_AT_name        : (strp) (offset: 0x5eca): PyUnicode_Kind
+    <f54>   DW_AT_name        : (strp) (offset: 0x5ece): PyUnicode_Kind
     <f58>   DW_AT_encoding    : (data1) 7	(unsigned)
     <f59>   DW_AT_byte_size   : (data1) 4
     <f5a>   DW_AT_type        : (ref4) <0x44>, unsigned int
     <f5e>   DW_AT_decl_file   : (data1) 14
     <f5f>   DW_AT_decl_line   : (data2) 313
     <f61>   DW_AT_decl_column : (data1) 6
     <f62>   DW_AT_sibling     : (ref4) <0xf7f>
  <2><f66>: Abbrev Number: 70 (DW_TAG_enumerator)
     <f67>   DW_AT_name        : (strp) (offset: 0x32af): PyUnicode_WCHAR_KIND
     <f6b>   DW_AT_const_value : (data1) 0
  <2><f6c>: Abbrev Number: 70 (DW_TAG_enumerator)
     <f6d>   DW_AT_name        : (strp) (offset: 0xd67): PyUnicode_1BYTE_KIND
     <f71>   DW_AT_const_value : (data1) 1
  <2><f72>: Abbrev Number: 70 (DW_TAG_enumerator)
-    <f73>   DW_AT_name        : (strp) (offset: 0x1fc6): PyUnicode_2BYTE_KIND
+    <f73>   DW_AT_name        : (strp) (offset: 0x1fe8): PyUnicode_2BYTE_KIND
     <f77>   DW_AT_const_value : (data1) 2
  <2><f78>: Abbrev Number: 70 (DW_TAG_enumerator)
-    <f79>   DW_AT_name        : (strp) (offset: 0x449a): PyUnicode_4BYTE_KIND
+    <f79>   DW_AT_name        : (strp) (offset: 0x447a): PyUnicode_4BYTE_KIND
     <f7d>   DW_AT_const_value : (data1) 4
  <2><f7e>: Abbrev Number: 0
  <1><f7f>: Abbrev Number: 24 (DW_TAG_typedef)
     <f80>   DW_AT_name        : (strp) (offset: 0xe15): PyLongObject
     <f84>   DW_AT_decl_file   : (data1) 15
     <f85>   DW_AT_decl_line   : (data1) 10
     <f86>   DW_AT_decl_column : (data1) 28
@@ -2106,46 +2106,46 @@
     <f99>   DW_AT_name        : (strp) (offset: 0x1749): ob_base
     <f9d>   DW_AT_decl_file   : (data1) 16
     <f9e>   DW_AT_decl_line   : (data1) 86
     <f9f>   DW_AT_decl_column : (data1) 5
     <fa0>   DW_AT_type        : (ref4) <0x48d>, PyVarObject
     <fa4>   DW_AT_data_member_location: (data1) 0
  <2><fa5>: Abbrev Number: 14 (DW_TAG_member)
-    <fa6>   DW_AT_name        : (strp) (offset: 0x603b): ob_digit
+    <fa6>   DW_AT_name        : (strp) (offset: 0x603f): ob_digit
     <faa>   DW_AT_decl_file   : (data1) 16
     <fab>   DW_AT_decl_line   : (data1) 87
     <fac>   DW_AT_decl_column : (data1) 11
     <fad>   DW_AT_type        : (ref4) <0xfd0>, digit, uint32_t, __uint32_t, unsigned int
     <fb1>   DW_AT_data_member_location: (data1) 24
  <2><fb2>: Abbrev Number: 0
  <1><fb3>: Abbrev Number: 45 (DW_TAG_variable)
-    <fb4>   DW_AT_name        : (strp) (offset: 0x51f8): PyLong_Type
+    <fb4>   DW_AT_name        : (strp) (offset: 0x51d8): PyLong_Type
     <fb8>   DW_AT_decl_file   : (data1) 15
     <fb9>   DW_AT_decl_line   : (data1) 12
     <fba>   DW_AT_decl_column : (data1) 26
     <fbb>   DW_AT_type        : (ref4) <0x17c>, PyTypeObject, _typeobject
     <fbf>   DW_AT_external    : (flag_present) 1
     <fbf>   DW_AT_declaration : (flag_present) 1
  <1><fbf>: Abbrev Number: 24 (DW_TAG_typedef)
-    <fc0>   DW_AT_name        : (strp) (offset: 0x603e): digit
+    <fc0>   DW_AT_name        : (strp) (offset: 0x6042): digit
     <fc4>   DW_AT_decl_file   : (data1) 16
     <fc5>   DW_AT_decl_line   : (data1) 45
     <fc6>   DW_AT_decl_column : (data1) 18
     <fc7>   DW_AT_type        : (ref4) <0x140>, uint32_t, __uint32_t, unsigned int
  <1><fcb>: Abbrev Number: 35 (DW_TAG_const_type)
     <fcc>   DW_AT_type        : (ref4) <0xfbf>, digit, uint32_t, __uint32_t, unsigned int
  <1><fd0>: Abbrev Number: 30 (DW_TAG_array_type)
     <fd1>   DW_AT_type        : (ref4) <0xfbf>, digit, uint32_t, __uint32_t, unsigned int
     <fd5>   DW_AT_sibling     : (ref4) <0xfe0>
  <2><fd9>: Abbrev Number: 31 (DW_TAG_subrange_type)
     <fda>   DW_AT_type        : (ref4) <0x3d>, long unsigned int
     <fde>   DW_AT_upper_bound : (data1) 0
  <2><fdf>: Abbrev Number: 0
  <1><fe0>: Abbrev Number: 45 (DW_TAG_variable)
-    <fe1>   DW_AT_name        : (strp) (offset: 0x46e7): _Py_FalseStruct
+    <fe1>   DW_AT_name        : (strp) (offset: 0x46c7): _Py_FalseStruct
     <fe5>   DW_AT_decl_file   : (data1) 17
     <fe6>   DW_AT_decl_line   : (data1) 18
     <fe7>   DW_AT_decl_column : (data1) 32
     <fe8>   DW_AT_type        : (ref4) <0xf8b>, _longobject
     <fec>   DW_AT_external    : (flag_present) 1
     <fec>   DW_AT_declaration : (flag_present) 1
  <1><fec>: Abbrev Number: 45 (DW_TAG_variable)
@@ -2166,23 +2166,23 @@
     <1002>   DW_AT_name        : (strp) (offset: 0x1749): ob_base
     <1006>   DW_AT_decl_file   : (data1) 18
     <1007>   DW_AT_decl_line   : (data1) 16
     <1008>   DW_AT_decl_column : (data1) 5
     <1009>   DW_AT_type        : (ref4) <0x458>, PyObject, _object
     <100d>   DW_AT_data_member_location: (data1) 0
  <2><100e>: Abbrev Number: 14 (DW_TAG_member)
-    <100f>   DW_AT_name        : (strp) (offset: 0x5bdc): ob_fval
+    <100f>   DW_AT_name        : (strp) (offset: 0x5bbc): ob_fval
     <1013>   DW_AT_decl_file   : (data1) 18
     <1014>   DW_AT_decl_line   : (data1) 17
     <1015>   DW_AT_decl_column : (data1) 12
     <1016>   DW_AT_type        : (ref4) <0x2a>, double
     <101a>   DW_AT_data_member_location: (data1) 16
  <2><101b>: Abbrev Number: 0
  <1><101c>: Abbrev Number: 24 (DW_TAG_typedef)
-    <101d>   DW_AT_name        : (strp) (offset: 0x3983): PyFloatObject
+    <101d>   DW_AT_name        : (strp) (offset: 0x3963): PyFloatObject
     <1021>   DW_AT_decl_file   : (data1) 18
     <1022>   DW_AT_decl_line   : (data1) 18
     <1023>   DW_AT_decl_column : (data1) 3
     <1024>   DW_AT_type        : (ref4) <0xff8>
  <1><1028>: Abbrev Number: 45 (DW_TAG_variable)
     <1029>   DW_AT_name        : (strp) (offset: 0xa09): PyFloat_Type
     <102d>   DW_AT_decl_file   : (data1) 18
@@ -2230,15 +2230,15 @@
  <1><1074>: Abbrev Number: 24 (DW_TAG_typedef)
     <1075>   DW_AT_name        : (strp) (offset: 0x115c): PyTupleObject
     <1079>   DW_AT_decl_file   : (data1) 20
     <107a>   DW_AT_decl_line   : (data1) 11
     <107b>   DW_AT_decl_column : (data1) 3
     <107c>   DW_AT_type        : (ref4) <0x1040>
  <1><1080>: Abbrev Number: 45 (DW_TAG_variable)
-    <1081>   DW_AT_name        : (strp) (offset: 0x1e3f): PyList_Type
+    <1081>   DW_AT_name        : (strp) (offset: 0x1e61): PyList_Type
     <1085>   DW_AT_decl_file   : (data1) 21
     <1086>   DW_AT_decl_line   : (data1) 20
     <1087>   DW_AT_decl_column : (data1) 26
     <1088>   DW_AT_type        : (ref4) <0x17c>, PyTypeObject, _typeobject
     <108c>   DW_AT_external    : (flag_present) 1
     <108c>   DW_AT_declaration : (flag_present) 1
  <1><108c>: Abbrev Number: 53 (DW_TAG_structure_type)
@@ -2258,23 +2258,23 @@
     <10a3>   DW_AT_name        : (strp) (offset: 0x15c5): ob_item
     <10a7>   DW_AT_decl_file   : (data1) 22
     <10a8>   DW_AT_decl_line   : (data1) 8
     <10a9>   DW_AT_decl_column : (data1) 16
     <10aa>   DW_AT_type        : (ref4) <0xc33>
     <10ae>   DW_AT_data_member_location: (data1) 24
  <2><10af>: Abbrev Number: 14 (DW_TAG_member)
-    <10b0>   DW_AT_name        : (strp) (offset: 0x5f38): allocated
+    <10b0>   DW_AT_name        : (strp) (offset: 0x5f3c): allocated
     <10b4>   DW_AT_decl_file   : (data1) 22
     <10b5>   DW_AT_decl_line   : (data1) 21
     <10b6>   DW_AT_decl_column : (data1) 16
     <10b7>   DW_AT_type        : (ref4) <0x158>, Py_ssize_t, ssize_t, __ssize_t, long int
     <10bb>   DW_AT_data_member_location: (data1) 32
  <2><10bc>: Abbrev Number: 0
  <1><10bd>: Abbrev Number: 24 (DW_TAG_typedef)
-    <10be>   DW_AT_name        : (strp) (offset: 0x599b): PyListObject
+    <10be>   DW_AT_name        : (strp) (offset: 0x597b): PyListObject
     <10c2>   DW_AT_decl_file   : (data1) 22
     <10c3>   DW_AT_decl_line   : (data1) 22
     <10c4>   DW_AT_decl_column : (data1) 3
     <10c5>   DW_AT_type        : (ref4) <0x108c>
  <1><10c9>: Abbrev Number: 45 (DW_TAG_variable)
     <10ca>   DW_AT_name        : (strp) (offset: 0x2b5c): PyDict_Type
     <10ce>   DW_AT_decl_file   : (data1) 23
@@ -2320,15 +2320,15 @@
     <1112>   DW_AT_name        : (strp) (offset: 0x151b): ma_keys
     <1116>   DW_AT_decl_file   : (data1) 24
     <1117>   DW_AT_decl_line   : (data1) 20
     <1118>   DW_AT_decl_column : (data1) 23
     <1119>   DW_AT_type        : (ref4) <0x112c>
     <111d>   DW_AT_data_member_location: (data1) 32
  <2><111e>: Abbrev Number: 14 (DW_TAG_member)
-    <111f>   DW_AT_name        : (strp) (offset: 0x401d): ma_values
+    <111f>   DW_AT_name        : (strp) (offset: 0x3ffd): ma_values
     <1123>   DW_AT_decl_file   : (data1) 24
     <1124>   DW_AT_decl_line   : (data1) 27
     <1125>   DW_AT_decl_column : (data1) 16
     <1126>   DW_AT_type        : (ref4) <0xc33>
     <112a>   DW_AT_data_member_location: (data1) 40
  <2><112b>: Abbrev Number: 0
  <1><112c>: Abbrev Number: 26 (DW_TAG_pointer_type)
@@ -2337,29 +2337,29 @@
  <1><1131>: Abbrev Number: 24 (DW_TAG_typedef)
     <1132>   DW_AT_name        : (strp) (offset: 0x14f0): PyDictObject
     <1136>   DW_AT_decl_file   : (data1) 24
     <1137>   DW_AT_decl_line   : (data1) 28
     <1138>   DW_AT_decl_column : (data1) 3
     <1139>   DW_AT_type        : (ref4) <0x10e1>
  <1><113d>: Abbrev Number: 45 (DW_TAG_variable)
-    <113e>   DW_AT_name        : (strp) (offset: 0x5f27): PyCFunction_Type
+    <113e>   DW_AT_name        : (strp) (offset: 0x5f2b): PyCFunction_Type
     <1142>   DW_AT_decl_file   : (data1) 10
     <1143>   DW_AT_decl_line   : (data1) 14
     <1144>   DW_AT_decl_column : (data1) 26
     <1145>   DW_AT_type        : (ref4) <0x17c>, PyTypeObject, _typeobject
     <1149>   DW_AT_external    : (flag_present) 1
     <1149>   DW_AT_declaration : (flag_present) 1
  <1><1149>: Abbrev Number: 24 (DW_TAG_typedef)
     <114a>   DW_AT_name        : (strp) (offset: 0x346f): PyCFunction
     <114e>   DW_AT_decl_file   : (data1) 10
     <114f>   DW_AT_decl_line   : (data1) 19
     <1150>   DW_AT_decl_column : (data1) 21
     <1151>   DW_AT_type        : (ref4) <0x4cf>
  <1><1155>: Abbrev Number: 24 (DW_TAG_typedef)
-    <1156>   DW_AT_name        : (strp) (offset: 0x3a9c): _PyCFunctionFast
+    <1156>   DW_AT_name        : (strp) (offset: 0x3a7c): _PyCFunctionFast
     <115a>   DW_AT_decl_file   : (data1) 10
     <115b>   DW_AT_decl_line   : (data1) 20
     <115c>   DW_AT_decl_column : (data1) 21
     <115d>   DW_AT_type        : (ref4) <0x1161>
  <1><1161>: Abbrev Number: 26 (DW_TAG_pointer_type)
     <1162>   DW_AT_byte_size   : (implicit_const) 8
     <1162>   DW_AT_type        : (ref4) <0x1166>
@@ -2371,15 +2371,15 @@
     <1170>   DW_AT_type        : (ref4) <0x4b9>
  <2><1174>: Abbrev Number: 15 (DW_TAG_formal_parameter)
     <1175>   DW_AT_type        : (ref4) <0x940>
  <2><1179>: Abbrev Number: 15 (DW_TAG_formal_parameter)
     <117a>   DW_AT_type        : (ref4) <0x158>, Py_ssize_t, ssize_t, __ssize_t, long int
  <2><117e>: Abbrev Number: 0
  <1><117f>: Abbrev Number: 24 (DW_TAG_typedef)
-    <1180>   DW_AT_name        : (strp) (offset: 0x403f): PyCFunctionWithKeywords
+    <1180>   DW_AT_name        : (strp) (offset: 0x401f): PyCFunctionWithKeywords
     <1184>   DW_AT_decl_file   : (data1) 10
     <1185>   DW_AT_decl_line   : (data1) 21
     <1186>   DW_AT_decl_column : (data1) 21
     <1187>   DW_AT_type        : (ref4) <0x4f4>
  <1><118b>: Abbrev Number: 24 (DW_TAG_typedef)
     <118c>   DW_AT_name        : (strp) (offset: 0x163b): _PyCFunctionFastWithKeywords
     <1190>   DW_AT_decl_file   : (data1) 10
@@ -2418,22 +2418,22 @@
     <11d0>   DW_AT_name        : (strp) (offset: 0x1749): ob_base
     <11d4>   DW_AT_decl_file   : (data1) 25
     <11d5>   DW_AT_decl_line   : (data1) 24
     <11d6>   DW_AT_decl_column : (data1) 5
     <11d7>   DW_AT_type        : (ref4) <0x458>, PyObject, _object
     <11db>   DW_AT_data_member_location: (data1) 0
  <2><11dc>: Abbrev Number: 14 (DW_TAG_member)
-    <11dd>   DW_AT_name        : (strp) (offset: 0x5462): m_ml
+    <11dd>   DW_AT_name        : (strp) (offset: 0x5442): m_ml
     <11e1>   DW_AT_decl_file   : (data1) 25
     <11e2>   DW_AT_decl_line   : (data1) 25
     <11e3>   DW_AT_decl_column : (data1) 18
     <11e4>   DW_AT_type        : (ref4) <0x121e>
     <11e8>   DW_AT_data_member_location: (data1) 16
  <2><11e9>: Abbrev Number: 14 (DW_TAG_member)
-    <11ea>   DW_AT_name        : (strp) (offset: 0x3aea): m_self
+    <11ea>   DW_AT_name        : (strp) (offset: 0x3aca): m_self
     <11ee>   DW_AT_decl_file   : (data1) 25
     <11ef>   DW_AT_decl_line   : (data1) 26
     <11f0>   DW_AT_decl_column : (data1) 18
     <11f1>   DW_AT_type        : (ref4) <0x4b9>
     <11f5>   DW_AT_data_member_location: (data1) 24
  <2><11f6>: Abbrev Number: 14 (DW_TAG_member)
     <11f7>   DW_AT_name        : (strp) (offset: 0x18cf): m_module
@@ -2446,32 +2446,32 @@
     <1204>   DW_AT_name        : (strp) (offset: 0x3487): m_weakreflist
     <1208>   DW_AT_decl_file   : (data1) 25
     <1209>   DW_AT_decl_line   : (data1) 28
     <120a>   DW_AT_decl_column : (data1) 18
     <120b>   DW_AT_type        : (ref4) <0x4b9>
     <120f>   DW_AT_data_member_location: (data1) 40
  <2><1210>: Abbrev Number: 14 (DW_TAG_member)
-    <1211>   DW_AT_name        : (strp) (offset: 0x4b78): vectorcall
+    <1211>   DW_AT_name        : (strp) (offset: 0x4b58): vectorcall
     <1215>   DW_AT_decl_file   : (data1) 25
     <1216>   DW_AT_decl_line   : (data1) 29
     <1217>   DW_AT_decl_column : (data1) 20
     <1218>   DW_AT_type        : (ref4) <0x911>, vectorcallfunc
     <121c>   DW_AT_data_member_location: (data1) 48
  <2><121d>: Abbrev Number: 0
  <1><121e>: Abbrev Number: 26 (DW_TAG_pointer_type)
     <121f>   DW_AT_byte_size   : (implicit_const) 8
     <121f>   DW_AT_type        : (ref4) <0x11ba>, PyMethodDef, PyMethodDef
  <1><1223>: Abbrev Number: 24 (DW_TAG_typedef)
-    <1224>   DW_AT_name        : (strp) (offset: 0x6279): PyCFunctionObject
+    <1224>   DW_AT_name        : (strp) (offset: 0x627d): PyCFunctionObject
     <1228>   DW_AT_decl_file   : (data1) 25
     <1229>   DW_AT_decl_line   : (data1) 30
     <122a>   DW_AT_decl_column : (data1) 3
     <122b>   DW_AT_type        : (ref4) <0x11c6>
  <1><122f>: Abbrev Number: 58 (DW_TAG_structure_type)
-    <1230>   DW_AT_name        : (strp) (offset: 0x1e0c): PyModuleDef_Base
+    <1230>   DW_AT_name        : (strp) (offset: 0x1e2e): PyModuleDef_Base
     <1234>   DW_AT_byte_size   : (data1) 40
     <1235>   DW_AT_decl_file   : (data1) 26
     <1236>   DW_AT_decl_line   : (data1) 44
     <1237>   DW_AT_decl_column : (data1) 16
     <1238>   DW_AT_sibling     : (ref4) <0x1271>
  <2><123c>: Abbrev Number: 14 (DW_TAG_member)
     <123d>   DW_AT_name        : (strp) (offset: 0x1749): ob_base
@@ -2491,29 +2491,29 @@
     <1257>   DW_AT_name        : (strp) (offset: 0x2795): m_index
     <125b>   DW_AT_decl_file   : (data1) 26
     <125c>   DW_AT_decl_line   : (data1) 47
     <125d>   DW_AT_decl_column : (data1) 14
     <125e>   DW_AT_type        : (ref4) <0x158>, Py_ssize_t, ssize_t, __ssize_t, long int
     <1262>   DW_AT_data_member_location: (data1) 24
  <2><1263>: Abbrev Number: 14 (DW_TAG_member)
-    <1264>   DW_AT_name        : (strp) (offset: 0x3d5c): m_copy
+    <1264>   DW_AT_name        : (strp) (offset: 0x3d3c): m_copy
     <1268>   DW_AT_decl_file   : (data1) 26
     <1269>   DW_AT_decl_line   : (data1) 48
     <126a>   DW_AT_decl_column : (data1) 13
     <126b>   DW_AT_type        : (ref4) <0x4b9>
     <126f>   DW_AT_data_member_location: (data1) 32
  <2><1270>: Abbrev Number: 0
  <1><1271>: Abbrev Number: 109 (DW_TAG_subroutine_type)
     <1272>   DW_AT_prototyped  : (flag_present) 1
     <1272>   DW_AT_type        : (ref4) <0x4b9>
  <1><1276>: Abbrev Number: 26 (DW_TAG_pointer_type)
     <1277>   DW_AT_byte_size   : (implicit_const) 8
     <1277>   DW_AT_type        : (ref4) <0x1271>
  <1><127b>: Abbrev Number: 24 (DW_TAG_typedef)
-    <127c>   DW_AT_name        : (strp) (offset: 0x1e0c): PyModuleDef_Base
+    <127c>   DW_AT_name        : (strp) (offset: 0x1e2e): PyModuleDef_Base
     <1280>   DW_AT_decl_file   : (data1) 26
     <1281>   DW_AT_decl_line   : (data1) 49
     <1282>   DW_AT_decl_column : (data1) 3
     <1283>   DW_AT_type        : (ref4) <0x122f>, PyModuleDef_Base
  <1><1287>: Abbrev Number: 58 (DW_TAG_structure_type)
     <1288>   DW_AT_name        : (strp) (offset: 0x33cc): PyModuleDef_Slot
     <128c>   DW_AT_byte_size   : (data1) 16
@@ -2546,64 +2546,64 @@
     <12bc>   DW_AT_name        : (strp) (offset: 0x1399): PyModuleDef
     <12c0>   DW_AT_byte_size   : (data1) 104
     <12c1>   DW_AT_decl_file   : (data1) 26
     <12c2>   DW_AT_decl_line   : (data1) 75
     <12c3>   DW_AT_decl_column : (data1) 16
     <12c4>   DW_AT_sibling     : (ref4) <0x133e>
  <2><12c8>: Abbrev Number: 14 (DW_TAG_member)
-    <12c9>   DW_AT_name        : (strp) (offset: 0x5161): m_base
+    <12c9>   DW_AT_name        : (strp) (offset: 0x5141): m_base
     <12cd>   DW_AT_decl_file   : (data1) 26
     <12ce>   DW_AT_decl_line   : (data1) 76
     <12cf>   DW_AT_decl_column : (data1) 20
